Mathematica 11.0.1 for Mac OS X x86 (64-bit)
Copyright 1988-2016 Wolfram Research, Inc.

In[1]:= 
In[2]:= tmInOn;
t=0.000013

In[3]:= In[3]:= << FeynArts`
FeynArts 3.10 (28 Nov 2016)
by Hagen Eck, Sepp Kueblbeck, and Thomas Hahn

t=0.059577

In[4]:= In[4]:= << FormCalc`
FormCalc 9.5 (24 Jan 2017)
by Thomas Hahn

t=0.168900

In[5]:= In[5]:= NClear[];
t=0.176977

In[6]:= N[sqrt2] = Sqrt[2.];
t=0.177359

In[7]:= sqrt2/: sqrt2/2 = 1/sqrt2;
t=0.177700

In[8]:= sqrt2/: sqrt2^2 = 2;
t=0.177992

In[9]:= sqrt2/: sqrt2^-2 = 1/2;
t=0.178300

In[10]:= In[10]:= nsimp = (*Simplify*) TermCollect;
t=0.178724

In[11]:= fsimp = (*FullSimplify*) Simplify;
t=0.179143

In[12]:= In[12]:= $KeepDir = name;
t=0.179398

In[13]:= In[13]:=                            massrulz = {
  MT -> Mf[tT,3],
  MT2 -> Mf2[tT,3],
  Mdy[g_] :> Mf[bTR,g],
(*
  MB -> Mf[bTR,3],
  MB2 -> Mf[bTR,3],
*)
  MSf[s_,4,g_] :> MSf[s,bTR,g],
  MSf2[s_,4,g_] :> MSf2[s,bTR,g],
  USf[s__,4,g_] :> USf[s,bTR,g],
  USfC[s__,4,g_] :> USfC[s,bTR,g],
  MASf[as_,4] :> MASf[as,bTR],
  MASf2[as_,4] :> MASf2[as,bTR],
  UASf[as__,4] :> UASf[as,bTR],
  UASfC[as__,4] :> UASfC[as,bTR],
  Kf[g__,4] :> Kf[g,bTR],
  KfC[g__,4] :> KfC[g,bTR]
};
t=0.184673

In[14]:= In[14]:= Neglect[Mq] = Neglect[Mq2] = 0;
t=0.185196

In[15]:= Sq[Mq] = Mq2;
t=0.185497

In[16]:= In[16]:= MU = Mq; MU2 = Mq2;
t=0.185867

In[17]:= MC = Mq; MC2 = Mq2;
t=0.186137

In[18]:= In[18]:= MS = MS2 = 0;
t=0.186460

In[19]:= MM = MM2 = 0;
t=0.186774

In[20]:= In[20]:= Sq[Alfas] =.;
t=0.187061

In[21]:= Alfas = asMT;
t=0.187286

In[22]:= In[22]:= (*_USf = VCha = UCha = IndexDelta;*)
t=0.187757

In[23]:= In[23]:= fs = 2;
t=0.187936

In[24]:= fl["bsll"] = 2;
t=0.188189

In[25]:= In[25]:= proc = F[4, {3}] -> {F[4, {fs}], F[2, {fl[me]}], -F[2, {fl[me]}]};
t=0.188821

In[26]:= In[26]:= opt["All"] = Sequence[];
t=0.189136

In[27]:= opt["Hp"] = LastSelections -> S[5];
t=0.189509

In[28]:= opt["Cha"] = LastSelections -> F[12];
t=0.189981

In[29]:= opt["Neu"] = Sequence[ExcludeParticles -> F[15], LastSelections -> F[11]];
t=0.190866

In[30]:= opt["Glu"] = LastSelections -> F[15];
t=0.191357

In[31]:= opt["SM"] = ExcludeParticles -> {F[11|12|15], S[5] (*, V[1]*)};
t=0.192150

In[32]:= In[32]:= In[32]:= SCsimp[expr_, var_:{SW, CW, SW2, CW2},
  rul_:{CW2 -> 1 - SW2, SW2 -> 1 - CW2}] :=
Block[ {p, s},
  p = Cases[expr /. p_Plus :> fsimp[p] /; LeafCount[p] < 100,
    p_Plus /; Complement[Cases[p, _Symbol, {-1}], var] === {},
    Infinity] //Union;
  Block[var,
    s = Fold[nsimp[#1 /. #2]&, p, rul] /.
      (Join[#, Map[-#&, #, {2}]]&)[Reverse/@ rul];
    expr /. Thread[p -> s] ]
]
t=0.195288

In[33]:= In[33]:= In[33]:=                            simp[ins_, opt___] :=
Block[ {amp},
  Paint[ins,
    ColumnsXRows -> {4, 5},
    (*PaintLevel -> {Classes},*)
    DisplayFunction -> (Export[name <> ".ps", #, ImageSize -> 72 2 {4, 5}]&)];

  amp = CreateFeynAmp[ins];

  DiracChain[__, _k, __] = 0;

amp = TagDiagrams[amp];

  amp = Keep[
    CalcFeynAmp[amp, opt,
(*RetainFile -> True,*)
      CancelQ2 -> False,
(*OnShell -> ExceptDirac,*)
      FermionChains -> Chiral,
(*SortDen -> False,*)
(*RetainFile -> True,*)
      (*Antisymmetrize -> False, FermionOrder -> None*)
      FermionOrder -> {2, 1, 3, 4}],
    ".raw" ];

  (*Put[amp, name <> ".raw"];*)

  amp = Keep[
    amp //. Subexpr[] /.
      C0i[Except[LoopTools`cc0 | LoopTools`cc00], __] -> 0 /.
      D0i[Except[LoopTools`dd0 | LoopTools`dd00], __] -> 0 /.
      (* (#1 -> 0 &)@@@ Select[Abbr[], !FreeQ[#, DiracChain[__, _k, __]] &] /. *)
      FormCalc`S23 | FormCalc`T12 | FormCalc`T13 -> 0,
    ".raw2" ];

  (*Put[amp, name <> ".raw2"];*)

  amp = Keep[
    ApplyUnitarity[amp, CKM, 3 (*, TermCollect*)],
    ".amp" ];

(*
  Put[amp, name <> ".amp"];
  Put[Abbr[], name <> ".abbr"];
*)

  Plus@@ amp //. Abbr[]
];
t=0.204706

In[34]:= In[34]:= tops = CreateTopologies[1, 1 -> 3
  (*, ExcludeTopologies -> Loops[4]*)
  (*, ExcludeTopologies -> {Tadpoles, WFCorrections}*)
  (*, TrianglesOnly*)
  (*, BoxesOnly*)
];
t=0.237422

In[35]:= In[35]:= ins = InsertFields[tops,
  proc, opt[tag],
  InsertionLevel -> {Particles},
Restrictions -> NoLightFHCoupling,
  Model -> myMSSMQCD];
loading generic model file /Users/hahn/FeynArts/Models/Lorentz.gen
> $GenericMixing is OFF
generic model {Lorentz} initialized

loading classes model file /Users/hahn/fh-2d/gen/bsll/myMSSMQCD.mod
  loading classes model file /Users/hahn/FeynArts/Models/MSSMQCD.mod
    loading classes model file /Users/hahn/FeynArts/Models/MSSM.mod
> 75 particles (incl. antiparticles) in 26 classes
> $CounterTerms are ON
> 403 vertices
classes model {myMSSMQCD} initialized

Excluding 18 field point(s) (incl. charge-conjugate ones)

inserting at level(s) {Particles}
> Top. 1: 0 Particles insertions
> Top. 2: 0 Particles insertions
> Top. 3: 0 Particles insertions
> Top. 4: 0 Particles insertions
> Top. 5: 0 Particles insertions
> Top. 6: 0 Particles insertions
> Top. 7: 0 Particles insertions
> Top. 8: 0 Particles insertions
> Top. 9: 0 Particles insertions
> Top. 10: 0 Particles insertions
> Top. 11: 0 Particles insertions
> Top. 12: 12 Particles insertions
> Top. 13: 3 Particles insertions
> Top. 14: 0 Particles insertions
> Top. 15: 0 Particles insertions
> Top. 16: 0 Particles insertions
> Top. 17: 0 Particles insertions
> Top. 18: 0 Particles insertions
> Top. 19: 0 Particles insertions
> Top. 20: 0 Particles insertions
> Top. 21: 0 Particles insertions
> Top. 22: 0 Particles insertions
> Top. 23: 0 Particles insertions
> Top. 24: 0 Particles insertions
> Top. 25: 0 Particles insertions
> Top. 26: 0 Particles insertions
> Top. 27: 0 Particles insertions
> Top. 28: 0 Particles insertions
> Top. 29: 0 Particles insertions
> Top. 30: 0 Particles insertions
> Top. 31: 0 Particles insertions
> Top. 32: 0 Particles insertions
> Top. 33: 0 Particles insertions
> Top. 34: 0 Particles insertions
> Top. 35: 0 Particles insertions
> Top. 36: 0 Particles insertions
> Top. 37: 0 Particles insertions
> Top. 38: 0 Particles insertions
> Top. 39: 0 Particles insertions
> Top. 40: 0 Particles insertions
> Top. 41: 0 Particles insertions
> Top. 42: 0 Particles insertions
> Top. 43: 0 Particles insertions
> Top. 44: 0 Particles insertions
> Top. 45: 0 Particles insertions
> Top. 46: 0 Particles insertions
> Top. 47: 0 Particles insertions
> Top. 48: 0 Particles insertions
> Top. 49: 0 Particles insertions
> Top. 50: 0 Particles insertions
> Top. 51: 0 Particles insertions
> Top. 52: 0 Particles insertions
> Top. 53: 0 Particles insertions
> Top. 54: 0 Particles insertions
> Top. 55: 0 Particles insertions
> Top. 56: 0 Particles insertions
> Top. 57: 0 Particles insertions
> Top. 58: 0 Particles insertions
> Top. 59: 0 Particles insertions
> Top. 60: 0 Particles insertions
> Top. 61: 0 Particles insertions
> Top. 62: 0 Particles insertions
> Top. 63: 0 Particles insertions
> Top. 64: 0 Particles insertions
> Top. 65: 0 Particles insertions
> Top. 66: 0 Particles insertions
> Top. 67: 0 Particles insertions
> Top. 68: 0 Particles insertions
> Top. 69: 0 Particles insertions
> Top. 70: 0 Particles insertions
> Top. 71: 0 Particles insertions
> Top. 72: 0 Particles insertions
> Top. 73: 0 Particles insertions
> Top. 74: 0 Particles insertions
> Top. 75: 0 Particles insertions
> Top. 76: 0 Particles insertions
> Top. 77: 0 Particles insertions
> Top. 78: 0 Particles insertions
> Top. 79: 0 Particles insertions
> Top. 80: 0 Particles insertions
> Top. 81: 0 Particles insertions
> Top. 82: 0 Particles insertions
> Top. 83: 0 Particles insertions
> Top. 84: 0 Particles insertions
> Top. 85: 0 Particles insertions
> Top. 86: 0 Particles insertions
> Top. 87: 0 Particles insertions
> Top. 88: 0 Particles insertions
> Top. 89: 0 Particles insertions
> Top. 90: 0 Particles insertions
> Top. 91: 0 Particles insertions
> Top. 92: 0 Particles insertions
> Top. 93: 0 Particles insertions
> Top. 94: 0 Particles insertions
> Top. 95: 0 Particles insertions
> Top. 96: 0 Particles insertions
> Top. 97: 0 Particles insertions
> Top. 98: 6 Particles insertions
> Top. 99: 6 Particles insertions

Restoring 18 field point(s)
in total: 27 Particles insertions

t=1.215051

In[36]:= In[36]:= amp = simp[ins];> Top. 1 ae/bfcgdg/ghefehfh.m, 12 diagrams
> Top. 2 ae/bfcgdh/efegfhgh.m, 3 diagrams
> Top. 3 ae/bfcgdg/egehfhfh.m, 6 diagrams
> Top. 4 ae/bfcgdg/fgfheheh.m, 6 diagrams

creating amplitudes at level(s) {Particles}
> Top. 1: 12 Particles amplitudes
> Top. 2: 3 Particles amplitudes
> Top. 3: 6 Particles amplitudes
> Top. 4: 6 Particles amplitudes
in total: 27 Particles amplitudes

preparing FORM code in /Users/hahn/fh-2d/gen/bsll/fc-amp-2.frm
running FORM... 
ok

saved in m/bsll-Cha.raw.m
saved in m/bsll-Cha.raw2.m
saved in m/bsll-Cha.amp.m

t=330.631752

In[37]:= In[37]:= In[37]:= Alfa2 = (Alfa = Sqrt[2]/Pi GF MW2 SW2)^2;
t=330.632555

In[38]:= In[38]:= Attributes[C0z] = Attributes[C00z] =
Attributes[D0z] = Attributes[D00z] = {Orderless};
t=330.633613

In[39]:= In[39]:=                                              (*
C0i[LoopTools`cc0, 0, 0, 0, m__] := C0z[m];
C0i[LoopTools`cc00, 0, 0, 0, m__] := C00z[m];
D0i[LoopTools`dd0, 0, 0, 0, 0, 0, 0, m__] := D0z[m];
D0i[LoopTools`dd00, 0, 0, 0, 0, 0, 0, m__] := D00z[m];
*)
t=330.635221

In[40]:= In[40]:= C0i[LoopTools`cc0, _, _, _, m__] := C0z[m];
t=330.635675

In[41]:= C0i[LoopTools`cc00, _, _, _, m__] := C00z[m];
t=330.636103

In[42]:= D0i[LoopTools`dd0, _, _, _, _, _, _, m__] := D0z[m];
t=330.636627

In[43]:= D0i[LoopTools`dd00, _, _, _, _, _, _, m__] := D00z[m];
t=330.637150

In[44]:= In[44]:= C0z[m1_, m2_, m2_] := c0[m1, m2];
t=330.637524

In[45]:= C00z[m1_, m2_, m2_] := c00[m1, m2];
t=330.637855

In[46]:= B0i[bb0, _, m1_, m2_] := b0[m1, m2];
t=330.638186

In[47]:= B0i[bb1, _, m1_, m2_] := b1[m1, m2];
t=330.638539

In[48]:= In[48]:= (* approximate, from 0811.2891: *)
t=330.638864

In[49]:= c00[m1_, m2_] := -1/2 b1[m1, m2];
t=330.639205

In[50]:= c0[m1_, m2_] := (-1/2 + b1[m2, m1] + 2 c00[m1, m2])/m2
t=330.639661

In[51]:= In[51]:= (* exact: *)
t=330.639832

In[52]:= b1[m1_, m2_] := 1/2/(m1 - m2) (A0[m2] - m1 b0[m1, m2] - (m1 + m2)/2);
t=330.640457

In[53]:= b0[m1_, m2_] := (A0[m1] - A0[m2])/(m1 - m2);
t=330.640896

In[54]:=                            (*
b1[m1_, m2_] := B1[0, m1, m2];
b0[m1_, m2_] := B0[0, m1, m2];
*)
t=330.641461

In[55]:= In[55]:= In[55]:= Attributes[ColorDelta] = {Orderless};
t=330.641874

In[56]:= In[56]:= omend[om_Integer, g___] :=
  Opi[g, {R, L}[[1 + Mod[om + Length[{g}], 2]]]]
t=330.642623

In[57]:= In[57]:= dc = Keep[
  amp /.
    {Col1 -> 1, Col3 -> 3,
     Col2 -> 2, Col4 -> 4,
     Spinor[_[1], __] -> b,
     Spinor[_[2], __] -> s,
     Spinor[_[3], __] -> lbar,
     Spinor[_[4], __] -> l} /.
    SUNT[i_, j_] -> ColorDelta[i, j] /.
    Mat[ DiracChain[s1:s, g1__, s2_] ColorDelta[1, 2] *
         DiracChain[s3_, g2__, s4_] ] :>
      Op[s1.omend[g1].s2, s3.omend[g2].s4] /.
    {Sqrt[2] -> sqrt2, 1/Sqrt[2] -> 1/sqrt2},
  ".dc" ];saved in m/bsll-Cha.dc.m

t=330.684739

In[58]:= In[58]:= (*Put[dc, name <> ".dc"];*)
t=330.685213

In[59]:= In[59]:= In[59]:= (* VVV = ijk ijk, vvv = ijk kji *)
t=330.685754

In[60]:= In[60]:=                                     (*
Op[s1_ . Opi[Lor[i_], Lor[j_], Lor[k_], om1_] . s2_,
   s3_ . Opi[Lor[i_], Lor[j_], Lor[k_], om2_] . s4_] :=
  Opx[s1.VVV[om1].s2, s3.VVV[om2].s4];
*)
t=330.687363

In[61]:= In[61]:= Op[s1_ . Opi[Lor[i_], Lor[j_], Lor[k_], om1_] . s2_,
   s3_ . Opi[Lor[i_], Lor[j_], Lor[k_], om2_] . s4_] :=
  20 Opx[s1.V[om1].s2, s3.V[om2].s4] -
  Opx[s1.vvv[om1].s2, s3.vvv[om2].s4];	(* see ijk2kji.m *)
t=330.689578

In[62]:= In[62]:= Op[s1_ . Opi[Lor[i_], Lor[j_], om1_] . s2_,
   s3_ . Opi[Lor[i_], Lor[j_], om2_] . s4_] :=
  Opx[s1.T[om1].s2, s3.T[om2].s4];
t=330.690710

In[63]:= In[63]:= Op[s1_ . Opi[Lor[i_], om1_] . s2_,
   s3_ . Opi[Lor[i_], om2_] . s4_] :=
  Opx[s1.V[om1].s2, s3.V[om2].s4];
t=330.692055

In[64]:= In[64]:= Op[s1_ . Opi[om1_] . s2_,
   s3_ . Opi[om2_] . s4_] :=
  Opx[s1.S[om1].s2, s3.S[om2].s4];
t=330.692866

In[65]:= In[65]:= In[65]:= Opx[s.op_[om1_].b, lbar.op_[om2_].l] := OP[op[om1, om2]];
t=330.693426

In[66]:= In[66]:= In[66]:= Put[dc, name <> ".dc1"];
t=330.710443

In[67]:= In[67]:= In[67]:=                            (* Note: the following Fierz identities from 0112305 are used only
   if FermionOrder -> None is set in CalcFeynAmp above.  In this case
   also Antisymmetric -> False must be used, or else the VVV bits
   are invalid. *)
t=330.713047

In[68]:= In[68]:= (* 0112305 Eq. 4.6 *)
t=330.713367

In[69]:= OP[vvv[L,L]] := Evan[VVV[L,L]] + 4 OP[V[L,L]];
t=330.713855

In[70]:= In[70]:= (* 0112305 Eq. 4.9 *)
t=330.714102

In[71]:= Opx[s.VVV[L].l, l.VVV[L].b] := Evan[VVV[L,L]] + 16 OP[V[L,L]];
t=330.714651

In[72]:= Opx[s.VVV[L].l, l.VVV[R].b] := Evan[VVV[R,R]] + 4 OP[V[L,R]];
t=330.715186

In[73]:= In[73]:= (* 0112305 Eq. 4.7 *)
t=330.715507

In[74]:= Opx[s.S[L].l, l.S[L].b] := Evan[S[L,L]] - 1/2 OP[S[L,L]] + 1/8 OP[T[L,L]];
t=330.716136

In[75]:= Opx[s.S[L].l, l.S[R].b] := Evan[S[L,R]] - 1/2 OP[V[R,L]];
t=330.716666

In[76]:= Opx[s.V[L].l, l.V[L].b] := Evan[V[L,L]] + OP[V[L,L]];
t=330.717158

In[77]:= Opx[s.V[L].l, l.V[R].b] := Evan[V[L,R]] - 2 OP[S[R,L]];
t=330.717663

In[78]:= Opx[s.T[L].l, l.T[L].b] := Evan[T[L,L]] + 6 OP[S[L,L]] + 1/2 OP[T[L,L]];
t=330.718252

In[79]:= In[79]:= In[79]:= (* due to vanishing of the corresponding hadronic matrix elements: *)
t=330.718872

In[80]:= OP[V[om_,R]] := +OP[V[om,5]]/2;
t=330.719169

In[81]:= OP[V[om_,L]] := -OP[V[om,5]]/2;
t=330.719484

In[82]:= OP[_T] = 0;
t=330.719662

In[83]:= In[83]:= OP[S[om_,R]] := OP[S[om,1]] + OP[S[om,5]];
t=330.720108

In[84]:= OP[S[om_,L]] := OP[S[om,1]] - OP[S[om,5]];
t=330.720594

In[85]:= In[85]:= MB2/: MB2 Den[MB2, 0] = 1;
t=330.720907

In[86]:= MB2/: MB2 Den[0, MB2] = -1;
t=330.721180

In[87]:= In[87]:=          dc = Keep[
  SCsimp[nsimp[dc /. Mq|Mq2 -> 0 /. massrulz /.
    {o_OP -> o, S|T|U -> 0} /.
    {Finite -> 1, _Evan -> 0, _Evanescent -> 0}] (* /.
    {MB2 Den[MB2, 0] -> 1, MB2 Den[0, MB2] -> -1} *)
  ] /. a_ CW2 + a_ SW2 -> a //nsimp,
  ".dc2" ];saved in m/bsll-Cha.dc2.m

t=337.305672

In[88]:= In[88]:= (*Put[dc, name <> ".dc2"];*)
t=337.306117

In[89]:= In[89]:= In[89]:= OpName[V[L,5]] := "CAL";
t=337.306453

In[90]:= OpName[V[R,5]] := "CAR";
t=337.306790

In[91]:= OpName[S[L,1]] := "CSL";
t=337.307128

In[92]:= OpName[S[R,1]] := "CSR";
t=337.307512

In[93]:= OpName[S[L,5]] := "CPL";
t=337.307877

In[94]:= OpName[S[R,5]] := "CPR";
t=337.308261

In[95]:= In[95]:= In[95]:= ops = Union[Cases[dc, _OP, Infinity]];
t=337.309133

In[96]:= In[96]:= fac = -2 GF/Sqrt[2] Alfa/(2 Pi SW2) CKM[3,3] CKMC[3,fs] /.
  GF -> Alfa Pi/(Sqrt[2] MW2 SW2);
t=337.310263

In[97]:= In[97]:= coeff = Keep[
  ((OpName@@ #) <> tag -> Coefficient[dc, #]/fac)&/@ ops,
  ".coeff.raw" ];saved in m/bsll-Cha.coeff.raw.m

t=337.500936

In[98]:= In[98]:= (*Put[coeff, name <> ".coeff.raw"];*)
t=337.501548

In[99]:= In[99]:= chk = dc /. Thread[ops -> 0];
t=337.504110

In[100]:= If[ chk =!= 0,
  Print["WARNING: REMAINDER NOT ZERO"];
  Put[chk, name <> ".ZERO"] ];
t=337.505187

In[101]:= In[101]:= In[101]:= fin[var_ -> expr_] := (Print[var]; var -> fin[expr]);
t=337.505931

In[102]:= In[102]:= (*fin[expr_] := nsimp @ Collect[expr, {_SumOver, _Log}, fsimp];*)
t=337.506611

In[103]:= In[103]:= fin[expr_] := nsimp @ Collect[expr,
  {_SumOver, _Log, _A0, _C0z, _C00z, _D0z, _D00z}, fsimp];
t=337.507450

In[104]:= In[104]:= coeff = Keep[fin/@ coeff, ".coeff"];CALCha
CARCha
saved in m/bsll-Cha.coeff.m

t=370.116952

In[105]:= In[105]:= (*Put[coeff, name <> ".coeff"];*)
t=370.117466

In[106]:= In[106]:= If[ !FreeQ[coeff, Den[0, 0]],
  Print["WARNING: REMAINING Den[0, 0]"] ];
t=370.118618

In[107]:= In[107]:= Mino3 = "M_3";
t=370.118958

In[108]:= Mino3C = "M_3C";
t=370.119236

In[109]:= In[109]:= hh = OpenFortran[name <> ".F"];
t=370.120018

In[110]:= In[110]:= $DebugPre[1] = "#ifdef DETAILED_DEBUG\n";
t=370.120739

In[111]:= $DebugCmd[1] = "DCONST \"```` =\", `` ENDL\n";
t=370.121346

In[112]:= $DebugPost[1] = "#endif\n";
t=370.121699

In[113]:= In[113]:= WriteExpr[hh, coeff /. IndexDelta -> Delta /. Den[0, 0] -> Den00,
  (*HornerStyle -> False,*)
  TmpType -> False,
  Expensive -> {_B0i, _C0z, _C00z, _D0z, _D00z},
  RealArgs -> {B0i, B0, B1, C0z, C00z, D0z, D00z},
  Optimize -> True,
  DebugLines -> True,
  FinalCollect -> True];
t=370.771086

In[114]:= In[114]:= Close[hh];
t=370.772265

In[115]:= 
