Mathematica 11.2.0 Kernel for Linux x86 (64-bit)
Copyright 1988-2017 Wolfram Research, Inc.

In[1]:= 
In[2]:= In[2]:= << FeynArts`;
FeynArts 3.10 (12 Mar 2018)
by Hagen Eck, Sepp Kueblbeck, and Thomas Hahn

In[3]:= In[3]:= << FormCalc`;
FormCalc 9.6 (7 Mar 2018)
by Thomas Hahn

In[4]:= In[4]:= (*SetOptions[CalcFeynAmp, RetainFile -> True];*)
In[5]:= (*ReadFormDebug[1, "decay.log"];*)
In[6]:= In[6]:= FormPre = Identity;
In[7]:= FormSub = Identity;
In[8]:= In[8]:= SetLanguage["Fortran", "novec"];
In[9]:= In[9]:= (*loopopt[1] = LastSelections -> F[15];*)
In[10]:= _loopopt = Sequence[];
In[11]:= In[11]:= simp = If[nosimp === 0, Identity, Simplify];
In[12]:= fsimp = If[nosimp === 0, Identity, FullSimplify];
In[13]:= In[13]:= NClear[];
In[14]:= In[14]:= N[sqrt2] = Sqrt[2.];
In[15]:= sqrt2/: sqrt2/2 = 1/sqrt2;
In[16]:= sqrt2/: sqrt2^2 = 2;
In[17]:= sqrt2/: sqrt2^-2 = 1/2;
In[18]:= In[18]:= Sq[m1] = m12;
In[19]:= Sq[m2] = m22;
In[20]:= Sq[m3] = m32;
In[21]:= Sq[MHiggs[a_]] = MHiggs2[a];
In[22]:= MH = MHiggs[hno];
In[23]:= MH2 = MHiggs2[hno];
In[24]:= Mh0tree = Mh0;
In[25]:= Mh0tree2 = Mh02;
In[26]:= MHHtree = MHH;
In[27]:= MHHtree2 = MHH2;
In[28]:= MA0tree = MA0;
In[29]:= MA0tree2 = MA02;
In[30]:= In[30]:= Sq[GS] =.;
In[31]:= GS = GSMH;
In[32]:= Sq[GSMH] = 4 Pi AlfasMH;
In[33]:= Sq[GSDb] = 4 Pi AlfasDb;
In[34]:= In[34]:= Sq[EL] =.;
In[35]:= EL = EL0;
In[36]:= Sq[EL0] = 4 Pi Alfa0;
In[37]:= In[37]:= trigrulz = {
  CA a_ + CA2 b_ :> CA (a + CA b),
  SA a_ + SA2 b_ :> SA (a + SA b),
  CB a_ + CB2 b_ :> CB (a + CB b),
  SB a_ + SB2 b_ :> SB (a + SB b)
};
In[38]:= In[38]:= frulz[_, 0] = {};
In[39]:= In[39]:= frulz[t_, ty_] := {
  Mf[t,g_] :> Mf[ty,g],
  Mf2[t,g_] :> Mf2[ty,g] };
In[40]:= In[40]:= sfrulz[t_, 0] := {		(* for SM *)
  Mqy[t,g_] :> Mf[t,g] };
In[41]:= In[41]:= sfrulz[t_, ty_] := {
  Mqy[t,g_] :> Mf[ty,g],
  MSf[s_,t,g_] :> MSf[s,ty,g],
  MSf2[s_,t,g_] :> MSf2[s,ty,g],
  USf[s__,t,g_] :> USf[s,ty,g],
  USfC[s__,t,g_] :> USfC[s,ty,g],
  MASf[as_,t] :> MASf[as,ty],
  MASf2[as_,t] :> MASf2[as,ty],
  UASf[as__,t] :> UASf[as,ty],
  UASfC[as__,t] :> UASfC[as,ty],
  Kf[g__,t] :> Kf[g,ty],
  KfC[g__,t] :> KfC[g,ty] };
In[42]:= In[42]:= massrulz[u_, uy_, d_, dy_] := Flatten[{
  frulz[3, u], sfrulz[3, uy],
  frulz[4, d], sfrulz[4, dy] }];
In[43]:= In[43]:= final[expr_] := expr /.
  gather[q_, a_:1] :> sgather[reim[q] a] /.
  sgather -> split /.
  { Finite -> 1,
    USf[a__] USfC[a__] :> USf2[a],
    ZHiggs[i_, j_] :> XHiggs[i, j, uzext],
    Sqrt[2] -> sqrt2,
    1/Sqrt[2] -> 1/sqrt2,
    re[h_[x__]] :> ToSymbol[h, "Re"][x],
    im[h_[x__]] :> ToSymbol[h, "Im"][x] } /.
  IndexDelta -> IDelta;
In[44]:= In[44]:= (*Mdy[g_] := Mfy[7, g];*)
In[45]:= Sq[Mfy[a__]] = Mfy2[a];
In[46]:= RealQ[_Mfy] = True;
In[47]:= In[47]:= Format[Mino3, FortranForm] := "M_3";
In[48]:= Format[Mino3C, FortranForm] := "M_3C";
In[49]:= In[49]:= In[49]:= $DebugPre[1] = "#ifdef DETAILED_DEBUG\n";
In[50]:= $DebugCmd[1] = "DCOUP \"" <> tag <> "-`1` `2` =\", `3` ENDL\n";
In[51]:= $DebugPost[1] = "#endif\n";
In[52]:= In[52]:= deepestOnly[{___, l_}] = {l};
In[53]:= In[53]:= SetOptions[Paint,
  PaintLevel :> deepestOnly[InsertionLevel],
  ColumnsXRows -> {3, 4}];
In[54]:= In[54]:= paint[_[], _] := {};
In[55]:= In[55]:= paint[ins_, suffix_] := (
  MkDir["d"];
  $PaintSE = ToFileName["d", tag <> "-"];
  Paint[ ins,
    DisplayFunction -> (Export[$PaintSE <> suffix <> ".ps",
      #, "PS", ImageSize -> 144 {3, 4} ]&) ]
) /; debug === 1;
In[56]:= In[56]:= In[56]:= SetOptions[WriteExpr, FinalCollect -> True];
In[57]:= In[57]:= In[57]:= Attributes[wfok] = {Orderless};
In[58]:= wfok[] = True;
In[59]:= wfok[_, S[4]] = wfok[_, V[2]] = True;
In[60]:= _wfok = False;
In[61]:= In[61]:= In[61]:= amps[loop_, proc_, model_, excl_, rul_, foo_, opt___] :=
Block[ {io, top, ins, insv, insct, amp, vert},
  SetOptions[InsertFields, Model -> model, opt];

  io = Length[Flatten[{#}]]&/@ proc;

  top = CreateTopologies[loop, io,
    ExcludeTopologies -> {Tadpoles, WFCorrections[excl]}];
  ins = InsertFields[top, proc, loopopt[loop]];
  insv = DiagramSelect[ins, wfok@@ WFCorrectionFields[##] &];
  paint[insv, "v" <> ToString[loop]];

  top = CreateCTTopologies[loop, io,
    ExcludeTopologies -> {TadpoleCTs, WFCorrectionCTs[excl]}];
  ins = InsertFields[top, proc];
  insct = DiagramSelect[ins, wfok@@ WFCorrectionCTFields[##] &];
  paint[insct, "ct" <> ToString[loop]];

  amp = CreateFeynAmp[Join[insv, Head[insv]@@ insct]];

  SetOptions[CalcFeynAmp, Dimension -> If[model === SM, D, 4]];

  amp = OffShell[amp, 1 -> m1,
    2 -> ((If[# === 0, m2 = m22 = 0]; m2)&),
    3 -> ((If[# === 0, m3 = m32 = 0]; m3)&)];

FormSub = simp1 (*Identity*) (*TermCollect*) (*Simplify*);
  vert = amp /. rul;
  vert = CalcFeynAmp[vert];
  vert = foo[vert];
  vert = final[vert];
  vert = Abbreviate[vert, 5, Preprocess -> simp1];
  vert = elimDiv[vert];
  vert
];
In[62]:= In[62]:= In[62]:= IDelta/: IDelta[i_, j_] a_. := Delta[i, j] (a /. {s_SumOver :> s, j -> i})
In[63]:= In[63]:= In[63]:= fxi[x_] := fsimp[x //. trigrulz] /. trigrulz;
In[64]:= In[64]:= Attributes[fsi] = {Listable};
In[65]:= fsi[var_ -> x_] := var -> fsi[x];
In[66]:= fsi[x_] := x /; FreeQ[x, Plus];
In[67]:= fsi[x_] := fsi[x] = fxi[fxi[x]];
In[68]:= In[68]:= xi[x_] := simp[x //. trigrulz] /. trigrulz;
In[69]:= In[69]:= Attributes[si] = {Listable};
In[70]:= si[var_ -> x_] := var -> si[x];
In[71]:= si[x_] := x /; FreeQ[x, Plus];
In[72]:= si[x_] := si[x] = xi[xi[x]];
In[73]:= In[73]:= simp1 = OnSize[100, fsi, 250, si, Map];
In[74]:= simp2 = fsimp;
In[75]:= In[75]:= loopint = _A0 | _B0 | _B1 | _B00 | _B11 | _DB0 | _DB1 | _DB00 | _DB11;
In[76]:= In[76]:= SetOptions[PrepareExpr,
  Expensive -> List@@ loopint,
  FinalTouch -> simp2];
In[77]:= In[77]:= In[77]:= elimDiv[expr_] := ToIndexIf[ expr /.
  (d:Den[MHiggs2[i_], MHiggs2[j_]]) :> d IndexDiff[i, j] ];
In[78]:= In[78]:= In[78]:= SetOptions[WriteSquaredME,
  FilePrefix -> tag <> "-",
  SymbolPrefix -> tag <> "_",
  Folder -> tag <> "-squaredme",
  FileHeader -> StringReplace[FileHeader /. Options[WriteSquaredME],
    "#endif" -> "* this file is part of FeynHiggs\n#endif"]];
In[79]:= In[79]:= SetOptions[WriteRenConst,
  Folder -> tag <> "-renconst"];
In[80]:= In[80]:= job[proc_, model_, excl_, rul0_, rul1_, foo_, opt___] :=
Block[ {v0, v1, col, abbr, sub, uzext, DoDim},
  v0 = amps[0, proc, model, excl, rul0, foo, opt];
  v1 = amps[1, proc, model, excl, rul1, foo, opt];

  uzext = If[ MatchQ[v0, _[0]], uzext0, uzext1 ];

  col = ColourME[All, All];
  abbr = OptimizeAbbr[final[Abbr[]]];
  sub = OptimizeAbbr[Subexpr[]];
  sub = fsi[sub];

  Put[{v0, v1, col, abbr, sub}, ToFileName["m", tag <> ".amp"]];

  rcs = FindRenConst[{v0, v1}][[1]];

  rcinc = If[ Length[rcs] === 0, "",
    "#include \"" <> tag <> "-RenConst.h.F\"\n"];

  SetOptions[WriteSquaredME, 
    FileIncludes -> {"\
#include \"externals.h\"\n\
#include \"types.h\"\n\
#include \"debug.h\"\n" <> rcinc,
      "\
#include \"inline.h\"\n" },
    SubroutineIncludes -> {"\
#include \"Decay.h\"\n" <> rcinc,
      "\
#include \"inline.h\"\n" }];

  WriteSquaredME[v0, v1, col, abbr, sub, "f",
    ExtraRules -> ToOldBRules,
    SymbolPrefix -> tag <> "_",
    LoopSquare -> True];	(* <<<!!! *)

  If[ Length[rcs] > 0,
FormSub = simp1;
    DoDim[gno1] = DoDim[gno2] = 3;
    rcs = final[foo[CalcRenConst[rcs, loopopt[1]] /. rul1] /.
      ToOldBRules];
    Put[rcs, ToFileName["m", tag <> ".rc"]];
    WriteRenConst[rcs, "f"] ];
];
In[81]:= In[81]:= In[81]:= gather/: gather[q_, expr_:1] x_ := gather[q, expr x] /;
  FreeQ[x, gather | SUNT | IndexDelta];
In[82]:= In[82]:= gather/: gather[q_, a_:1] + gather[q_, b_:1] := gather[q, a + b] /;
  FreeQ[{a, b}, gather];
In[83]:= In[83]:= In[83]:= sgather/: sgather[x_] + sgather[y_] := sgather[x + y];
In[84]:= In[84]:= sgather/: sgather[x_] y_ := sgather[x y];
In[85]:= In[85]:= sgather[0] = 0;
In[86]:= In[86]:= In[86]:= split[x_] := ReTilde[x /. reim -> re] + cI ImTilde[x /. reim -> im];
In[87]:= In[87]:= In[87]:= $CKM = True;
In[88]:= $FV = {12, 13, 14};
In[89]:= cMSSMhgaga = {"MSSMQCD", "dAlfa", "KW", "FV", "Kf", "HGpGm", "Yuk", "HMixExt"};
In[90]:= cMSSM = DeleteCases[cMSSMhgaga, "HGpGm"];
In[91]:= SM = {"SMQCD", "dAlfa", "Yuk", "dZH1"};
In[92]:= In[92]:= Hel[3] = Hel[2]
Out[92]= Hel[2]

In[93]:= In[93]:= In[93]:= decay["hgaga"] := job[
  S[10, {hno}] -> {V[1], V[1]},
  cMSSMhgaga, _,
  {}, {},
  # /. massrulz[tH, tH, 0, bBR] /. {
    Yuk[3|4, _, g_, g_] :> hgagaQ,
    Yuk[13|14, _, g_, g_] :> hgagaSq,
    Hbb[h_, g_, g_] :> HffDb[0, h, 4, g] Mf[4, g]/Mf[bBR, g] } &
];
In[94]:= In[94]:= decay["hgagaSM"] := job[
  S[1] -> {V[1], V[1]},
  SM, _,
  {}, {},
  # /. massrulz[tH, tH, 0, 0] /. {
    Yuk[3|4, _, g_, g_] :> hgagaQ } & ];
In[95]:= In[95]:= In[95]:= decay["hgaZ"] := job[
  S[10, {hno}] -> {V[1], V[2]},
  cMSSMhgaga, _,
  {}, {},
  # /. massrulz[tH, tH, 0, bBR] /. {
    _Yuk -> 1,
    Hbb[h_, g_, g_] :> HffDb[0, h, 4, g] Mf[4, g]/Mf[bBR, g] } & ];
In[96]:= In[96]:= decay["hgaZSM"] := job[
  S[1] -> {V[1], V[2]},
  SM, _,
  {}, {},
  # /. massrulz[tH, tH, 0, 0] /. _Yuk -> 1 & ];
In[97]:= In[97]:= In[97]:= decay["hgg"] := job[
  S[10, {hno}] -> {V[5], V[5]},
  cMSSM, _,
  {}, {},
  simp[# /. massrulz[tH, tH, 0, bBR] /. {
    Yuk[3, h_, g_, g_] :> hggU[h, g],
    Yuk[4, h_, g_, g_] :> gather[hggD[h, g]],
    Yuk[_, h_, g_, g_] :> hggSq[h],
    Hbb[h_, g_, g_] :> HffDb[0, h, 4, g] Mf[4, g]/Mf[bBR, g] }]&
];
In[98]:= In[98]:= decay["hggSM"] := job[
  S[1] -> {V[5], V[5]},
  SM, _,
  {}, {},
  simp[# /. massrulz[tH, tH, 0, 0] /. {
    Yuk[3, h_, g_, g_] :> hggU[h, g],
    Yuk[4, h_, g_, g_] :> gather[hggD[h, g]] }]& ];
In[99]:= In[99]:= In[99]:= decay["hhh"] := job[
  S[10, {hno}] -> {S[10, {hno1}], S[10, {hno2}]},
  cMSSM /. "FV" -> "Hhh", 2|3,
  {}, DeltaHhh -> 0,
  # /. massrulz[tM3, tM3, bTR, bTR] /. {
    _Yuk -> 1,
    _Hbb -> 1 } &,
  ExcludeParticles -> {U[5], V[5]} ];
In[100]:= In[100]:= In[100]:= hffjob[args__] :=
Block[ {dMWsq1, EL0 = ELMZ, Alfa0 = AlfaMZ},
  Options[dMWsq1] = {ExcludeParticles -> {}};	(* i.e. V[1] allowed here *)
  SetOptions[Abbreviate, Deny -> HffDb];
  job[ args,
    Hbb[h_, g_, g_] :> HffDb[sub1L, h, 4, g], _Hbb -> 1,
    # /. massrulz[tH, tH, bH, bH] /. _Yuk -> 1 &,
    ExcludeParticles -> {V[1], V[5]} ]
];
In[101]:= In[101]:= Hff[t_] := hffjob[
  S[10, {hno}] -> {F[t, {gno1}], -F[t, {gno2}]},
  cMSSM, 2|3 ];
In[102]:= In[102]:= HffSM[t_] := hffjob[
  S[1] -> {F[t, {gno1}], -F[t, {gno2}]},
  SM, _ ];
In[103]:= In[103]:= decay["hee"] := Hff[2];
In[104]:= In[104]:= decay["heeSM"] := HffSM[2];
In[105]:= In[105]:= decay["huu"] := Hff[3];
In[106]:= In[106]:= decay["huuSM"] := HffSM[3];
In[107]:= In[107]:= decay["hdd"] := Hff[4];
In[108]:= In[108]:= decay["hddSM"] := HffSM[4];
In[109]:= In[109]:= In[109]:=                                                   (*
decay["hcc"] := write[ CalcFeynAmp @
  amps[1, S[10, {hno}] -> {-F[12,{c1}], F[12,{c2}]}, "HMix"] ];
decay["hnn"] := write[ CalcFeynAmp @
  amps[1, S[10, {hno}] -> {F[11,{n1}], F[11,{c2}]}, "HMix"] ];
*)
In[110]:= In[110]:= In[110]:= _decay := Abort[];
In[111]:= In[111]:= In[111]:= decay[tag];
loading generic model file /home/pcl301/hahn/FeynArts/Models/Lorentz.gen
> $GenericMixing is OFF
generic model {Lorentz} initialized

loading classes model file /home/pcl301/hahn/FeynArts/Models/SMQCD.mod
  loading classes model file /home/pcl301/hahn/FeynArts/Models/SM.mod

$CKM = True

loading classes model file /home/pcl301/hahn/feynhiggs/gen/decays/dAlfa.mod
loading classes model file /home/pcl301/hahn/feynhiggs/gen/decays/Yuk.mod
loading classes model file /home/pcl301/hahn/feynhiggs/gen/decays/dZH1.mod
> 49 particles (incl. antiparticles) in 18 classes

Intersection::heads: 
   Heads List and IndexDelta at positions 3 and 1 are expected to be the same.

Intersection::heads: 
   Heads List and IndexDelta at positions 3 and 1 are expected to be the same.
> $CounterTerms are ON
> 93 vertices
> 121 counterterms of order 1
> 6 counterterms of order 2
classes model {SMQCD, dAlfa, Yuk, dZH1} initialized

Excluding 0 Generic, 2 Classes, and 2 Particles fields

inserting at level(s) {Generic, Classes}
> Top. 1: 1 Generic, 1 Classes insertions

Restoring 0 Generic, 2 Classes, and 2 Particles fields
in total: 1 Generic, 1 Classes insertions

Excluding 0 Generic, 2 Classes, and 2 Particles fields

Restoring 0 Generic, 2 Classes, and 2 Particles fields
in total: 0 Generic, 0 Classes insertions

creating amplitudes at level(s) {Generic, Classes}
> Top. 1: 1 Generic, 1 Classes amplitudes
in total: 1 Generic, 1 Classes amplitudes

preparing FORM code in /home/pcl301/hahn/feynhiggs/gen/decays/fc-amp-1.frm
running FORM... 
ok


Excluding 0 Generic, 2 Classes, and 2 Particles fields

inserting at level(s) {Generic, Classes}
> Top. 1: 6 Generic, 14 Classes insertions
> Top. 2: 0 Generic, 0 Classes insertions
> Top. 3: 0 Generic, 0 Classes insertions
> Top. 4: 0 Generic, 0 Classes insertions

Restoring 0 Generic, 2 Classes, and 2 Particles fields
in total: 6 Generic, 14 Classes insertions

Excluding 0 Generic, 2 Classes, and 2 Particles fields

inserting at level(s) {Generic, Classes}
> Top. 1: 1 Generic, 1 Classes insertions

Restoring 0 Generic, 2 Classes, and 2 Particles fields
in total: 1 Generic, 1 Classes insertions

creating amplitudes at level(s) {Generic, Classes}
> Top. 1: 6 Generic, 14 Classes amplitudes
> Top. 2: 1 Generic, 1 Classes amplitudes
in total: 7 Generic, 15 Classes amplitudes

preparing FORM code in /home/pcl301/hahn/feynhiggs/gen/decays/fc-amp-1.frm
running FORM... 
ok

dMZsq1

Excluding 0 Generic, 2 Classes, and 2 Particles fields

inserting at level(s) {Generic, Classes}
> Top. 1: 2 Generic, 4 Classes insertions
> Top. 2: 5 Generic, 12 Classes insertions

Restoring 0 Generic, 2 Classes, and 2 Particles fields
in total: 7 Generic, 16 Classes insertions

creating amplitudes at level(s) {Generic, Classes}
> Top. 1: 2 Generic, 4 Classes amplitudes
> Top. 2: 5 Generic, 12 Classes amplitudes
in total: 7 Generic, 16 Classes amplitudes

preparing FORM code in /home/pcl301/hahn/feynhiggs/gen/decays/fc-rc-1.frm
running FORM... 
ok

dZAA1heavy

Excluding 0 Generic, 4 Classes, and 12 Particles fields

inserting at level(s) {Generic, Classes}
> Top. 1: 2 Generic, 2 Classes insertions
> Top. 2: 5 Generic, 7 Classes insertions

Restoring 0 Generic, 4 Classes, and 12 Particles fields
in total: 7 Generic, 9 Classes insertions

creating amplitudes at level(s) {Generic, Classes}
> Top. 1: 2 Generic, 2 Classes amplitudes
> Top. 2: 5 Generic, 7 Classes amplitudes
in total: 7 Generic, 9 Classes amplitudes

preparing FORM code in /home/pcl301/hahn/feynhiggs/gen/decays/fc-rc-1.frm
running FORM... 
ok

dZAA1light

Excluding 0 Generic, 0 Classes, and 2 Particles fields

inserting at level(s) {Particles}
> Top. 1: 0 Particles insertions
> Top. 2: 8 Particles insertions

Restoring 0 Generic, 0 Classes, and 2 Particles fields
in total: 8 Particles insertions

creating amplitudes at level(s) {Particles}
> Top. 1: 8 Particles amplitudes
in total: 8 Particles amplitudes

preparing FORM code in /home/pcl301/hahn/feynhiggs/gen/decays/fc-rc-1.frm
running FORM... 
ok

dZZA1

Excluding 0 Generic, 2 Classes, and 2 Particles fields

inserting at level(s) {Generic, Classes}
> Top. 1: 2 Generic, 2 Classes insertions
> Top. 2: 5 Generic, 9 Classes insertions

Restoring 0 Generic, 2 Classes, and 2 Particles fields
in total: 7 Generic, 11 Classes insertions

creating amplitudes at level(s) {Generic, Classes}
> Top. 1: 2 Generic, 2 Classes amplitudes
> Top. 2: 5 Generic, 9 Classes amplitudes
in total: 7 Generic, 11 Classes amplitudes

preparing FORM code in /home/pcl301/hahn/feynhiggs/gen/decays/fc-rc-1.frm
running FORM... 
ok

dMWsq1

inserting at level(s) {Generic, Classes}
> Top. 1: 2 Generic, 6 Classes insertions
> Top. 2: 5 Generic, 13 Classes insertions
in total: 7 Generic, 19 Classes insertions

creating amplitudes at level(s) {Generic, Classes}
> Top. 1: 2 Generic, 6 Classes amplitudes
> Top. 2: 5 Generic, 13 Classes amplitudes
in total: 7 Generic, 19 Classes amplitudes

preparing FORM code in /home/pcl301/hahn/feynhiggs/gen/decays/fc-rc-1.frm
running FORM... 
ok

dSW1
dZe1
dZH1

Excluding 0 Generic, 2 Classes, and 2 Particles fields

inserting at level(s) {Generic, Classes}
> Top. 1: 2 Generic, 5 Classes insertions
> Top. 2: 5 Generic, 14 Classes insertions

Restoring 0 Generic, 2 Classes, and 2 Particles fields
in total: 7 Generic, 19 Classes insertions

creating amplitudes at level(s) {Generic, Classes}
> Top. 1: 2 Generic, 5 Classes amplitudes
> Top. 2: 5 Generic, 14 Classes amplitudes
in total: 7 Generic, 19 Classes amplitudes

preparing FORM code in /home/pcl301/hahn/feynhiggs/gen/decays/fc-rc-1.frm
running FORM... 
ok

dMf1[4, gno1]

Excluding 0 Generic, 2 Classes, and 2 Particles fields

inserting at level(s) {Generic, Classes}
> Top. 1: 0 Generic, 0 Classes insertions
> Top. 2: 2 Generic, 5 Classes insertions

Restoring 0 Generic, 2 Classes, and 2 Particles fields
in total: 2 Generic, 5 Classes insertions

creating amplitudes at level(s) {Generic, Classes}
> Top. 1: 2 Generic, 5 Classes amplitudes
in total: 2 Generic, 5 Classes amplitudes

preparing FORM code in /home/pcl301/hahn/feynhiggs/gen/decays/fc-rc-1.frm
running FORM... 
ok

dZfL1[4, gno1, gno2]

Excluding 0 Generic, 2 Classes, and 2 Particles fields

inserting at level(s) {Generic, Classes}
> Top. 1: 0 Generic, 0 Classes insertions
> Top. 2: 2 Generic, 5 Classes insertions

Restoring 0 Generic, 2 Classes, and 2 Particles fields
in total: 2 Generic, 5 Classes insertions

creating amplitudes at level(s) {Generic, Classes}
> Top. 1: 2 Generic, 5 Classes amplitudes
in total: 2 Generic, 5 Classes amplitudes

preparing FORM code in /home/pcl301/hahn/feynhiggs/gen/decays/fc-rc-1.frm
running FORM... 
ok

dZfL1[4, gno2, gno1]

Excluding 0 Generic, 2 Classes, and 2 Particles fields

inserting at level(s) {Generic, Classes}
> Top. 1: 0 Generic, 0 Classes insertions
> Top. 2: 2 Generic, 5 Classes insertions

Restoring 0 Generic, 2 Classes, and 2 Particles fields
in total: 2 Generic, 5 Classes insertions

creating amplitudes at level(s) {Generic, Classes}
> Top. 1: 2 Generic, 5 Classes amplitudes
in total: 2 Generic, 5 Classes amplitudes

preparing FORM code in /home/pcl301/hahn/feynhiggs/gen/decays/fc-rc-1.frm
running FORM... 
ok


Excluding 0 Generic, 2 Classes, and 2 Particles fields

inserting at level(s) {Generic, Classes}
> Top. 1: 0 Generic, 0 Classes insertions
> Top. 2: 2 Generic, 5 Classes insertions

Restoring 0 Generic, 2 Classes, and 2 Particles fields
in total: 2 Generic, 5 Classes insertions

creating amplitudes at level(s) {Generic, Classes}
> Top. 1: 2 Generic, 5 Classes amplitudes
in total: 2 Generic, 5 Classes amplitudes

preparing FORM code in /home/pcl301/hahn/feynhiggs/gen/decays/fc-rc-1.frm
running FORM... 
ok

dZfR1[4, gno1, gno2]
dZfR1[4, gno2, gno1]

In[112]:= In[112]:= Uninstall[$ReadFormHandle];
In[113]:= 

LinkObject::linkn: 
   Argument LinkObject[/home/pcl301/hahn/FormCalc/Linux-x86-64/ReadForm, 217, 
     1] in LinkClose[LinkObject[/home/pcl301/hahn/FormCalc/Linux-x86-64/ReadFo
       rm, 217, 1]] has an invalid LinkObject number; the link may be closed.

Unset::norep: Assignment on LinkPatterns for 
    LinkPatterns[LinkObject[/home/pcl301/hahn/FormCalc/Linux-x86-64/ReadForm, 
      217, 1]] not found.
