Mathematica 10.0 for Mac OS X x86 (64-bit)
Copyright 1988-2014 Wolfram Research, Inc.

In[1]:= 
FeynArts 3.9
by Hagen Eck, Sepp Kueblbeck, and Thomas Hahn
last revised 24 Oct 14

In[2]:= In[2]:= 
FormCalc 8.4
by Thomas Hahn
last revised 27 Feb 15

In[3]:= In[3]:= 
In[4]:= 
In[5]:= In[5]:= 
In[6]:= 
In[7]:= In[7]:= 
In[8]:= 
In[9]:= In[9]:= 
In[10]:= 
In[11]:= In[11]:= 
In[12]:= In[12]:= 
In[13]:= 
In[14]:= 
In[15]:= 
In[16]:= In[16]:= 
In[17]:= 
In[18]:= 
In[19]:= 
In[20]:= 
In[21]:= 
In[22]:= 
In[23]:= 
In[24]:= 
In[25]:= 
In[26]:= 
In[27]:= 
In[28]:= In[28]:= 
In[29]:= 
In[30]:= 
In[31]:= 
In[32]:= In[32]:= 
In[33]:= 
In[34]:= 
In[35]:= In[35]:= 
In[36]:= In[36]:= 
In[37]:= In[37]:= 
In[38]:= In[38]:= 
In[39]:= In[39]:= 
In[40]:= In[40]:= 
In[41]:= In[41]:= 
In[42]:= In[42]:= 
In[43]:= 
In[44]:= 
In[45]:= In[45]:= 
In[46]:= In[46]:= 
In[47]:= 
In[48]:= In[48]:= In[48]:= 
In[49]:= In[49]:= 
In[50]:= In[50]:= 
In[51]:= In[51]:= 
In[52]:= In[52]:= In[52]:= 
In[53]:= In[53]:= In[53]:= 
In[54]:= 
In[55]:= 
In[56]:= 
In[57]:= In[57]:= In[57]:= 
In[58]:= In[58]:=                   
In[59]:= In[59]:= In[59]:= 
In[60]:= In[60]:= In[60]:= 
In[61]:= In[61]:= 
In[62]:= 
In[63]:= 
In[64]:= In[64]:= 
In[65]:= In[65]:= 
In[66]:= 
In[67]:= 
In[68]:= In[68]:= 
In[69]:= 
In[70]:= In[70]:= 
In[71]:= In[71]:= 
In[72]:= In[72]:= In[72]:= 
In[73]:= In[73]:= In[73]:= 
In[74]:= In[74]:= 
In[75]:= In[75]:= 
In[76]:= In[76]:= In[76]:= 
In[77]:= In[77]:= 
In[78]:= In[78]:= In[78]:= 
In[79]:= In[79]:= 
In[80]:= In[80]:= 
In[81]:= In[81]:= In[81]:= 
In[82]:= In[82]:= In[82]:= 
In[83]:= 
In[84]:= 
In[85]:= 
In[86]:= 
In[87]:= In[87]:= 
Out[87]= Hel[2]

In[88]:= In[88]:= In[88]:= 
In[89]:= In[89]:= 
In[90]:= In[90]:= In[90]:= 
In[91]:= In[91]:= 
In[92]:= In[92]:= In[92]:= 
In[93]:= In[93]:= 
In[94]:= In[94]:= In[94]:= 
In[95]:= In[95]:= In[95]:= 
In[96]:= In[96]:= 
In[97]:= In[97]:= 
In[98]:= In[98]:= 
In[99]:= In[99]:= 
In[100]:= In[100]:= 
In[101]:= In[101]:= 
In[102]:= In[102]:= 
In[103]:= In[103]:= 
In[104]:= In[104]:= In[104]:=                                                   
In[105]:= In[105]:= In[105]:= 
In[106]:= In[106]:= In[106]:= 
loading generic model file /Users/hahn/FeynArts/Models/Lorentz.gen
> $GenericMixing is OFF
generic model {Lorentz} initialized

loading classes model file /Users/hahn/FeynArts/Models/SMQCD.mod
  loading classes model file /Users/hahn/FeynArts/Models/SM.mod

$CKM = True

loading classes model file /Users/hahn/fh-2a/gen/decays/dAlfa.mod
loading classes model file /Users/hahn/fh-2a/gen/decays/Yuk.mod
loading classes model file /Users/hahn/fh-2a/gen/decays/dZH1.mod
> 49 particles (incl. antiparticles) in 18 classes
> $CounterTerms are ON
> 93 vertices
> 121 counter terms of order 1
> 6 counter terms of order 2
classes model {SMQCD, dAlfa, Yuk, dZH1} initialized

inserting at level(s) {Generic, Classes}
> Top. 1: 0 Generic, 0 Classes insertions
in total: 0 Generic, 0 Classes insertions
in total: 0 Generic, 0 Classes insertions

creating amplitudes at level(s) {Generic, Classes}
in total: 0 Generic, 0 Classes amplitudes

inserting at level(s) {Generic, Classes}
> Top. 1: 10 Generic, 26 Classes insertions
> Top. 2: 2 Generic, 2 Classes insertions
> Top. 3: 1 Generic, 2 Classes insertions
> Top. 4: 1 Generic, 2 Classes insertions
in total: 14 Generic, 32 Classes insertions

inserting at level(s) {Generic, Classes}
> Top. 1: 1 Generic, 1 Classes insertions
in total: 1 Generic, 1 Classes insertions

creating amplitudes at level(s) {Generic, Classes}
> Top. 1: 10 Generic, 26 Classes amplitudes
> Top. 2: 2 Generic, 2 Classes amplitudes
> Top. 3: 1 Generic, 2 Classes amplitudes
> Top. 4: 1 Generic, 2 Classes amplitudes
> Top. 5: 1 Generic, 1 Classes amplitudes
in total: 15 Generic, 33 Classes amplitudes

preparing FORM code in /Users/hahn/fh-2a/gen/decays/fc-amp-1.frm
running FORM... 
ok


ColourME::nomat: Warning: No matrix elements to compute.
dZZA1

inserting at level(s) {Generic, Classes}
> Top. 1: 2 Generic, 2 Classes insertions
> Top. 2: 5 Generic, 9 Classes insertions
in total: 7 Generic, 11 Classes insertions

creating amplitudes at level(s) {Generic, Classes}
> Top. 1: 2 Generic, 2 Classes amplitudes
> Top. 2: 5 Generic, 9 Classes amplitudes
in total: 7 Generic, 11 Classes amplitudes

preparing FORM code in /Users/hahn/fh-2a/gen/decays/fc-rc-1.frm
running FORM... 
ok


In[107]:= In[107]:= 
In[108]:= 

LinkObject::linkn: 
   Argument LinkObject['/Users/hahn/FormCalc/MacOSX-x86-64/ReadForm', 66, 1]
     in LinkClose[LinkObject['/Users/hahn/FormCalc/MacOSX-x86-64/ReadForm', 
      66, 1]] has an invalid LinkObject number; the link may be closed.

Unset::norep: Assignment on LinkPatterns for 
    LinkPatterns[LinkObject['/Users/hahn/FormCalc/MacOSX-x86-64/ReadForm', 
      66, 1]] not found.
