Mathematica 12.0.0 Kernel for Linux x86 (64-bit)
Copyright 1988-2019 Wolfram Research, Inc.

In[1]:= 
In[2]:= In[2]:= << FeynArts`;
args::shdw: Symbol args appears in multiple contexts {FeynArts`, Global`}
    ; definitions in context FeynArts`
     may shadow or be shadowed by other definitions.

FeynArts 3.11 (11 Apr 2019)
by Hagen Eck, Sepp Kueblbeck, and Thomas Hahn

In[3]:= In[3]:= PrependTo[$ModelPath, "../model"];
In[4]:= In[4]:= << FormCalc`;
FormCalc 9.8 (22 Apr 2019)
by Thomas Hahn

In[5]:= In[5]:= (*SetOptions[CalcFeynAmp, RetainFile -> True];*)
In[6]:= (*ReadFormDebug[1, "decay.log"];*)
In[7]:= In[7]:= FormPre = Identity;
In[8]:= FormSub = Identity;
In[9]:= In[9]:= SetLanguage["Fortran", "novec"];
In[10]:= In[10]:= (*loopopt[1] = LastSelections -> F[15];*)
In[11]:= _loopopt = Sequence[];
In[12]:= In[12]:= simp = If[nosimp === 0, Identity, Simplify];
In[13]:= fsimp = If[nosimp === 0, Identity, FullSimplify];
In[14]:= In[14]:= NClear[];
In[15]:= In[15]:= N[sqrt2] = Sqrt[2.];
In[16]:= sqrt2/: sqrt2/2 = 1/sqrt2;
In[17]:= sqrt2/: sqrt2^2 = 2;
In[18]:= sqrt2/: sqrt2^-2 = 1/2;
In[19]:= In[19]:= Sq[m1] = m12;
In[20]:= Sq[m2] = m22;
In[21]:= Sq[m3] = m32;
In[22]:= Sq[MHiggs[a_]] = MHiggs2[a];
In[23]:= MH = MHiggs[hno];
In[24]:= MH2 = MHiggs2[hno];
In[25]:= Mh0tree = Mh0;
In[26]:= Mh0tree2 = Mh02;
In[27]:= MHHtree = MHH;
In[28]:= MHHtree2 = MHH2;
In[29]:= MA0tree = MA0;
In[30]:= MA0tree2 = MA02;
In[31]:= In[31]:= (*Mdy[g_] := Mfy[7, g];*)
In[32]:= Sq[Mfy[a__]] = Mfy2[a];
In[33]:= RealQ[_Mfy] = True;
In[34]:= In[34]:= Sq[GS] =.;
In[35]:= GS = GSMH;
In[36]:= Sq[GSMH] = 4 Pi AlfasMH;
In[37]:= Sq[GSDb] = 4 Pi AlfasDb;
In[38]:= In[38]:= Sq[EL] =.;
In[39]:= EL = EL0;
In[40]:= Sq[EL0] = 4 Pi Alfa0;
In[41]:= In[41]:= Format[Mino3, FortranForm] := "M_3";
In[42]:= Format[Mino3C, FortranForm] := "M_3C";
In[43]:= In[43]:= trigrulz = {
  CA a_ + CA2 b_ :> CA (a + CA b),
  SA a_ + SA2 b_ :> SA (a + SA b),
  CB a_ + CB2 b_ :> CB (a + CB b),
  SB a_ + SB2 b_ :> SB (a + SB b)
};
In[44]:= In[44]:= frulz[_, 0] = {};
In[45]:= In[45]:= frulz[t_, ty_] := {
  Mf[t,g_] :> Mf[ty,g],
  Mf2[t,g_] :> Mf2[ty,g] };
In[46]:= In[46]:= sfrulz[t_, 0] := {		(* for SM *)
  Mqy[t,g_] :> Mf[t,g] };
In[47]:= In[47]:= sfrulz[t_, ty_] := {
  Mqy[t,g_] :> Mf[ty,g],
  MSf[s_,t,g_] :> MSf[s,ty,g],
  MSf2[s_,t,g_] :> MSf2[s,ty,g],
  USf[s__,t,g_] :> USf[s,ty,g],
  USfC[s__,t,g_] :> USfC[s,ty,g],
  MASf[as_,t] :> MASf[as,ty],
  MASf2[as_,t] :> MASf2[as,ty],
  UASf[as__,t] :> UASf[as,ty],
  UASfC[as__,t] :> UASfC[as,ty],
  Kf[g__,t] :> Kf[g,ty],
  KfC[g__,t] :> KfC[g,ty] };
In[48]:= In[48]:= massrulz[u_, uy_, d_, dy_] := Flatten[{
  frulz[3, u], sfrulz[3, uy],
  frulz[4, d], sfrulz[4, dy] }];
In[49]:= In[49]:= final[expr_] := expr /.
  gather[q_, a_:1] :> sgather[reim[q] a] /.
  sgather -> split /.
  { Finite -> 1,
    USf[a__] USfC[a__] :> USf2[a],
    ZHiggs[i_, j_] :> XHiggs[i, j, uzext],
    Sqrt[2] -> sqrt2,
    1/Sqrt[2] -> 1/sqrt2,
    re[h_[x__]] :> ToSymbol[h, "Re"][x],
    im[h_[x__]] :> ToSymbol[h, "Im"][x] } /.
  IndexDelta -> IDelta;
In[50]:= In[50]:= In[50]:= toFortran[expr_] := expr /.
  d:dZ11H1fin|dZ12H1fin|dZ22H1fin|dTB1fin|dA1|dBn1|dBc1 :> d[zD];
In[51]:= SetOptions[WriteExpr, FinalFunction -> toFortran];
In[52]:= In[52]:=                            (*
dZ11H1fin = dZ12H1fin = dZ22H1fin = dTB1fin = dA1 = dBn1 = dBc1 = 0;
SetOptions[WriteExpr, FinalFunction -> (# /. ivev -> 1/vev &)];
*)
In[53]:= In[53]:= $DebugPre[1] = "#ifdef DETAILED_DEBUG\n";
In[54]:= $DebugCmd[1] = "DCOUP \"" <> tag <> "-`1` `2` =\", `3` ENDL\n";
In[55]:= $DebugPost[1] = "#endif\n";
In[56]:= In[56]:= deepestOnly[{___, l_}] = {l};
In[57]:= In[57]:= SetOptions[Paint,
  PaintLevel :> deepestOnly[InsertionLevel],
  ColumnsXRows -> {3, 4}];
In[58]:= In[58]:= paint[_[], _] := {};
In[59]:= In[59]:= paint[ins_, suffix_] := (
  MkDir["d"];
  $PaintSE = ToFileName["d", tag <> "-"];
  Paint[ ins,
    DisplayFunction -> (Export[$PaintSE <> suffix <> ".ps",
      #, "PS", ImageSize -> 144 {3, 4} ]&) ]
) /; debug === 1;
In[60]:= In[60]:= In[60]:= SetOptions[WriteExpr, FinalCollect -> True];
In[61]:= In[61]:= In[61]:= Attributes[wfok] = {Orderless};
In[62]:= wfok[] = True;
In[63]:= wfok[_, S[4]] = wfok[_, V[2]] = True;
In[64]:= _wfok = False;
In[65]:= In[65]:= In[65]:= amps[loop_, proc_, model_, excl_, rul_, foo_, opt___] :=
Block[ {io, top, ins, insv, insct, amp, vert},
  SetOptions[InsertFields, Model -> model, opt];

  io = Length[Flatten[{#}]]&/@ proc;

  top = CreateTopologies[loop, io,
    ExcludeTopologies -> {Tadpoles, WFCorrections[excl]}];
  ins = InsertFields[top, proc, loopopt[loop]];
  insv = DiagramSelect[ins, wfok@@ WFCorrectionFields[##] &];
  paint[insv, "v" <> ToString[loop]];

  top = CreateCTTopologies[loop, io,
    ExcludeTopologies -> {TadpoleCTs, WFCorrectionCTs[excl]}];
  ins = InsertFields[top, proc];
  insct = DiagramSelect[ins, wfok@@ WFCorrectionCTFields[##] &];
  paint[insct, "ct" <> ToString[loop]];

  amp = CreateFeynAmp[Join[insv, Head[insv]@@ insct]];

  SetOptions[CalcFeynAmp, Dimension -> If[model === "sm", D, 4]];

  amp = OffShell[amp, 1 -> m1,
    2 -> ((If[# === 0, m2 = m22 = 0]; m2)&),
    3 -> ((If[# === 0, m3 = m32 = 0]; m3)&)];

FormSub = simp1 (*Identity*) (*TermCollect*) (*Simplify*);
  vert = amp /. rul;
  vert = CalcFeynAmp[vert];
  vert = foo[vert];
  vert = final[vert];
  vert = Abbreviate[vert, 5, Preprocess -> simp1];
  vert = elimDiv[vert];
  vert
];
In[66]:= In[66]:= In[66]:= IDelta/: IDelta[i_, j_] a_. := Delta[i, j] (a /. {s_SumOver :> s, j -> i})
In[67]:= In[67]:= In[67]:= fxi[x_] := fsimp[x //. trigrulz] /. trigrulz;
In[68]:= In[68]:= Attributes[fsi] = {Listable};
In[69]:= fsi[var_ -> x_] := var -> fsi[x];
In[70]:= fsi[x_] := x /; FreeQ[x, Plus];
In[71]:= fsi[x_] := fsi[x] = fxi[fxi[x]];
In[72]:= In[72]:= xi[x_] := simp[x //. trigrulz] /. trigrulz;
In[73]:= In[73]:= Attributes[si] = {Listable};
In[74]:= si[var_ -> x_] := var -> si[x];
In[75]:= si[x_] := x /; FreeQ[x, Plus];
In[76]:= si[x_] := si[x] = xi[xi[x]];
In[77]:= In[77]:= simp1 = OnSize[100, fsi, 250, si, Map];
In[78]:= simp2 = fsimp;
In[79]:= In[79]:= SetOptions[PrepareExpr,
  Expensive -> LoopIntegral[__],
  FinalTouch -> simp2];
In[80]:= In[80]:= In[80]:= elimDiv[expr_] := ToIndexIf[ expr /.
  (d:Den[MHiggs2[i_], MHiggs2[j_]]) :> d IndexDiff[i, j] ];
In[81]:= In[81]:= In[81]:= SetOptions[WriteSquaredME,
  FilePrefix -> tag <> "-",
  SymbolPrefix -> tag <> "_",
  Folder -> tag <> "-squaredme",
  FileHeader -> StringReplace[FileHeader /. Options[WriteSquaredME],
    "#endif" -> "* this file is part of FeynHiggs\n#endif"]];
In[82]:= In[82]:= SetOptions[WriteRenConst,
  Folder -> tag <> "-renconst"];
In[83]:= In[83]:= job[proc_, model_, excl_, rul0_, rul1_, foo_, opt___] :=
Block[ {v0, v1, col, abbr, sub, uzext, rcs, rcinc, w, DoDim},
  v0 = amps[0, proc, model, excl, rul0, foo, opt];
  v1 = amps[1, proc, model, excl, rul1, foo, opt];

  uzext = If[ MatchQ[v0, _[0]], uzext0, uzext1 ];

  col = ColourME[All, All];
  abbr = OptimizeAbbr[final[Abbr[]]];
  sub = OptimizeAbbr[Subexpr[]];
  sub = fsi[sub];

  Put[{v0, v1, col, abbr, sub}, ToFileName["m", tag <> ".amp"]];

  rcs = FindRenConst[{v0, v1}][[1]];

  rcinc = If[ Length[rcs] === 0, "",
    "#include \"" <> tag <> "-RenConst.h.F\"\n"];

  SetOptions[WriteSquaredME,
    FileIncludes -> {"\
#include \"externals.h\"\n\
#include \"types.h\"\n\
#include \"debug.h\"\n" <> rcinc,
      "\
#include \"inline.h\"\n" },
    SubroutineIncludes -> {"\
#include \"Decay.h\"\n" <> rcinc,
      "\
#include \"inline.h\"\n" }];

  w = WriteSquaredME[v0, v1, col, abbr, sub, "f",
    ExtraRules -> ToOldBRules,
    SymbolPrefix -> tag <> "_",
    LoopSquare -> True];	(* <<<!!! *)

  Put[w, ToFileName["m", tag <> ".out"]];

  If[ Length[rcs] > 0,
FormSub = simp1;
    DoDim[gno1] = DoDim[gno2] = 3;
    rcs = final[foo[CalcRenConst[rcs, loopopt[1]] /. rul1] /.
      ToOldBRules];
    Put[rcs, ToFileName["m", tag <> ".rc"]];
    WriteRenConst[rcs, "f"] ];
];
In[84]:= In[84]:= In[84]:= gather/: gather[q_, expr_:1] x_ := gather[q, expr x] /;
  FreeQ[x, gather | SUNT | IndexDelta];
In[85]:= In[85]:= gather/: gather[q_, a_:1] + gather[q_, b_:1] := gather[q, a + b] /;
  FreeQ[{a, b}, gather];
In[86]:= In[86]:= In[86]:= sgather/: sgather[x_] + sgather[y_] := sgather[x + y];
In[87]:= In[87]:= sgather/: sgather[x_] y_ := sgather[x y];
In[88]:= In[88]:= sgather[0] = 0;
In[89]:= In[89]:= In[89]:= split[x_] := ReTilde[x /. reim -> re] + cI ImTilde[x /. reim -> im];
In[90]:= In[90]:= In[90]:= Hel[3] = Hel[2];
In[91]:= In[91]:= In[91]:= decay["hgaga"] := job[ S[10, {hno}] -> {V[1], V[1]},
  {"mssm-hgaga", "HMixExt"}, _, {}, {},
  # /. massrulz[tH, tH, 0, bBR] /. {
    Yuk[3|4, _, g_, g_] :> hgagaQ,
    Yuk[13|14, _, g_, g_] :> hgagaSq,
    Hbb[h_, g_, g_] :> HffDb[0, h, 4, g] Mf[4, g]/Mf[bBR, g] } & ];
In[92]:= In[92]:= decay["hgagaSM"] := job[ S[1] -> {V[1], V[1]},
  "sm", _, {}, {},
  # /. massrulz[tH, tH, 0, 0] /. {
    Yuk[3|4, _, g_, g_] :> hgagaQ } & ];
In[93]:= In[93]:= In[93]:= decay["hgaZ"] := job[ S[10, {hno}] -> {V[1], V[2]},
  {"mssm-hgaZ", "HMixExt"}, _, {}, {},
  # /. massrulz[tH, tH, 0, bBR] /. {
    _Yuk -> 1,
    Hbb[h_, g_, g_] :> HffDb[0, h, 4, g] Mf[4, g]/Mf[bBR, g] } & ];
In[94]:= In[94]:= decay["hgaZSM"] := job[ S[1] -> {V[1], V[2]},
  "sm", _, {}, {},
  # /. massrulz[tH, tH, 0, 0] /. _Yuk -> 1 & ];
In[95]:= In[95]:= In[95]:= decay["hgg"] := job[ S[10, {hno}] -> {V[5], V[5]},
  {"mssm-hgg", "HMixExt"}, _, {}, {},
  simp[# /. massrulz[tH, tH, 0, bBR] /. {
    Yuk[3, h_, g_, g_] :> hggU[h, g],
    Yuk[4, h_, g_, g_] :> gather[hggD[h, g]],
    Yuk[_, h_, g_, g_] :> hggSq[h],
    Hbb[h_, g_, g_] :> HffDb[0, h, 4, g] Mf[4, g]/Mf[bBR, g] }]&
];
In[96]:= In[96]:= decay["hggSM"] := job[ S[1] -> {V[5], V[5]},
  "sm", _, {}, {},
  simp[# /. massrulz[tH, tH, 0, 0] /. {
    Yuk[3, h_, g_, g_] :> hggU[h, g],
    Yuk[4, h_, g_, g_] :> gather[hggD[h, g]] }]& ];
In[97]:= In[97]:= In[97]:= decay["hhh"] := job[ S[10, {hno}] -> {S[10, {hno1}], S[10, {hno2}]},
  {"mssm-hhh", "HMixExt"}, 2|3, {}, DeltaHhh -> 0,
  # /. massrulz[tM3, tM3, bTR, bTR] /. {
    _Yuk -> 1,
    _Hbb -> 1 } &,
  ExcludeParticles -> {U[5], V[5]} ];
In[98]:= In[98]:= In[98]:= hffjob[args__] :=
Block[ {dMWsq1, EL0 = ELMZ, Alfa0 = AlfaMZ},
  Options[dMWsq1] = {ExcludeParticles -> {}};	(* i.e. V[1] allowed here *)
  SetOptions[Abbreviate, Deny -> HffDb];
  job[ args,
    Hbb[h_, g_, g_] :> HffDb[sub1L, h, 4, g], _Hbb -> 1,
    # /. massrulz[tH, tH, bH, bH] /. _Yuk -> 1 &,
    ExcludeParticles -> {V[1], V[5]} ]
];
In[99]:= In[99]:= Hff[t_] := hffjob[ S[10, {hno}] -> {F[t, {gno1}], -F[t, {gno2}]},
  {"mssm-hff", "HMixExt"}, 2|3 ];
In[100]:= In[100]:= HffSM[t_] := hffjob[ S[1] -> {F[t, {gno1}], -F[t, {gno2}]},
  "sm", _ ];
In[101]:= In[101]:= decay["hee"] := Hff[2];
In[102]:= In[102]:= decay["heeSM"] := HffSM[2];
In[103]:= In[103]:= decay["huu"] := Hff[3];
In[104]:= In[104]:= decay["huuSM"] := HffSM[3];
In[105]:= In[105]:= decay["hdd"] := Hff[4];
In[106]:= In[106]:= decay["hddSM"] := HffSM[4];
In[107]:= In[107]:= In[107]:=                                                   (*
decay["hcc"] := write[ CalcFeynAmp @
  amps[1, S[10, {hno}] -> {-F[12,{c1}], F[12,{c2}]}, "HMix"] ];
decay["hnn"] := write[ CalcFeynAmp @
  amps[1, S[10, {hno}] -> {F[11,{n1}], F[11,{c2}]}, "HMix"] ];
*)
In[108]:= In[108]:= In[108]:= _decay := Abort[];
In[109]:= In[109]:= In[109]:= decay[tag];
loading generic model file /home/desy/FeynTools/FeynArts-3.11/Models/Lorentz.\
 
      gen
> $GenericMixing is OFF
generic model {Lorentz} initialized

loading classes model file /home/desy/FeynTools/feynhiggs1/gen/decays/mssm-hh\
 
      h.mod
  loading classes model file /home/desy/FeynTools/feynhiggs1/gen/Models/MSSMD\
 
      ecay.mod
    loading classes model file /home/desy/FeynTools/FeynArts-3.11/Models/MSSM\
 
      QCD.mod
      loading classes model file 
 
     /home/desy/FeynTools/FeynArts-3.11/Models/MSSM.mod
    loading classes model file /home/desy/FeynTools/feynhiggs1/gen/Models/dMH\
 
      iggs1.mod
    loading classes model file /home/desy/FeynTools/feynhiggs1/gen/Models/dZH\
 
      iggs1.mod
  loading classes model file /home/desy/FeynTools/feynhiggs1/gen/Models/Kf.mod
  loading classes model file /home/desy/FeynTools/feynhiggs1/gen/Models/Yuk.m\
 
      od
  loading classes model file /home/desy/FeynTools/feynhiggs1/gen/Models/dAlfa\
 
      .mod
loading classes model file /home/desy/FeynTools/feynhiggs1/gen/Models/HMixExt\
 
      .mod
> 104 particles (incl. antiparticles) in 28 classes
> $CounterTerms are ON
> 685 vertices
> 67 counterterms of order 1
classes model {mssm-hhh, HMixExt} initialized

Excluding 0 Generic, 3 Classes, and 3 Particles fields

inserting at level(s) {Generic, Classes}
> Top. 1: 1 Generic, 1 Classes insertions

Restoring 0 Generic, 3 Classes, and 3 Particles fields
in total: 1 Generic, 1 Classes insertions

Excluding 0 Generic, 3 Classes, and 3 Particles fields

Restoring 0 Generic, 3 Classes, and 3 Particles fields
in total: 0 Generic, 0 Classes insertions

creating amplitudes at level(s) {Generic, Classes}
> Top. 1: 1 Generic, 1 Classes amplitudes
in total: 1 Generic, 1 Classes amplitudes

preparing FORM code in\
 
     /home/desy/FeynTools/feynhiggs1/gen/decays/fc-amp-1.frm
running FORM... 
ok


Excluding 0 Generic, 3 Classes, and 3 Particles fields

inserting at level(s) {Generic, Classes}
> Top. 1: 10 Generic, 202 Classes insertions
> Top. 2: 2 Generic, 20 Classes insertions
> Top. 3: 2 Generic, 46 Classes insertions
> Top. 4: 2 Generic, 20 Classes insertions
> Top. 5: 2 Generic, 20 Classes insertions
> Top. 6: 10 Generic, 118 Classes insertions

Restoring 0 Generic, 3 Classes, and 3 Particles fields
in total: 28 Generic, 426 Classes insertions

Excluding 0 Generic, 3 Classes, and 3 Particles fields

inserting at level(s) {Generic, Classes}
> Top. 1: 1 Generic, 1 Classes insertions
> Top. 2: 2 Generic, 5 Classes insertions

Restoring 0 Generic, 3 Classes, and 3 Particles fields
in total: 3 Generic, 6 Classes insertions

creating amplitudes at level(s) {Generic, Classes}
> Top. 1: 10 Generic, 202 Classes amplitudes
> Top. 2: 2 Generic, 20 Classes amplitudes
> Top. 3: 1 Generic, 10 Classes amplitudes
> Top. 4: 2 Generic, 20 Classes amplitudes
> Top. 5: 2 Generic, 20 Classes amplitudes
> Top. 6: 9 Generic, 40 Classes amplitudes
> Top. 7: 1 Generic, 1 Classes amplitudes
> Top. 8: 2 Generic, 2 Classes amplitudes
in total: 29 Generic, 315 Classes amplitudes

preparing FORM code in\
 
     /home/desy/FeynTools/feynhiggs1/gen/decays/fc-amp-1.frm
running FORM... 
ok


ColourME::nomat: Warning: No matrix elements to compute.

FindRenConst::nodef: 
   Warning: {dA1, dBn1} might be renormalization constants but have no
     definition.
dMWsq1

Excluding 0 Generic, 3 Classes, and 3 Particles fields

inserting at level(s) {Generic, Classes}
> Top. 1: 2 Generic, 13 Classes insertions
> Top. 2: 5 Generic, 21 Classes insertions

Restoring 0 Generic, 3 Classes, and 3 Particles fields
in total: 7 Generic, 34 Classes insertions

creating amplitudes at level(s) {Generic, Classes}
> Top. 1: 2 Generic, 13 Classes amplitudes
> Top. 2: 5 Generic, 21 Classes amplitudes
in total: 7 Generic, 34 Classes amplitudes

preparing FORM code in /home/desy/FeynTools/feynhiggs1/gen/decays/fc-rc-1.frm
running FORM... 
ok

dTA01

Excluding 0 Generic, 3 Classes, and 3 Particles fields

inserting at level(s) {Generic, Classes}
> Top. 1: 2 Generic, 8 Classes insertions

Restoring 0 Generic, 3 Classes, and 3 Particles fields
in total: 2 Generic, 8 Classes insertions

creating amplitudes at level(s) {Generic, Classes}
> Top. 1: 2 Generic, 8 Classes amplitudes
in total: 2 Generic, 8 Classes amplitudes

preparing FORM code in /home/desy/FeynTools/feynhiggs1/gen/decays/fc-rc-1.frm
running FORM... 
ok

dTB1div
dTh01

Excluding 0 Generic, 3 Classes, and 3 Particles fields

inserting at level(s) {Generic, Classes}
> Top. 1: 4 Generic, 20 Classes insertions

Restoring 0 Generic, 3 Classes, and 3 Particles fields
in total: 4 Generic, 20 Classes insertions

creating amplitudes at level(s) {Generic, Classes}
> Top. 1: 4 Generic, 20 Classes amplitudes
in total: 4 Generic, 20 Classes amplitudes

preparing FORM code in /home/desy/FeynTools/feynhiggs1/gen/decays/fc-rc-1.frm
running FORM... 
ok

dTHH1

Excluding 0 Generic, 3 Classes, and 3 Particles fields

inserting at level(s) {Generic, Classes}
> Top. 1: 4 Generic, 20 Classes insertions

Restoring 0 Generic, 3 Classes, and 3 Particles fields
in total: 4 Generic, 20 Classes insertions

creating amplitudes at level(s) {Generic, Classes}
> Top. 1: 4 Generic, 20 Classes amplitudes
in total: 4 Generic, 20 Classes amplitudes

preparing FORM code in /home/desy/FeynTools/feynhiggs1/gen/decays/fc-rc-1.frm
running FORM... 
ok

dZ11H1

Excluding 0 Generic, 3 Classes, and 3 Particles fields

inserting at level(s) {Generic, Classes}
> Top. 1: 2 Generic, 12 Classes insertions
> Top. 2: 5 Generic, 30 Classes insertions

Restoring 0 Generic, 3 Classes, and 3 Particles fields
in total: 7 Generic, 42 Classes insertions

creating amplitudes at level(s) {Generic, Classes}
> Top. 1: 2 Generic, 12 Classes amplitudes
> Top. 2: 5 Generic, 30 Classes amplitudes
in total: 7 Generic, 42 Classes amplitudes

preparing FORM code in /home/desy/FeynTools/feynhiggs1/gen/decays/fc-rc-1.frm
running FORM... 
ok

dZ22H1

Excluding 0 Generic, 3 Classes, and 3 Particles fields

inserting at level(s) {Generic, Classes}
> Top. 1: 2 Generic, 12 Classes insertions
> Top. 2: 5 Generic, 30 Classes insertions

Restoring 0 Generic, 3 Classes, and 3 Particles fields
in total: 7 Generic, 42 Classes insertions

creating amplitudes at level(s) {Generic, Classes}
> Top. 1: 2 Generic, 12 Classes amplitudes
> Top. 2: 5 Generic, 30 Classes amplitudes
in total: 7 Generic, 42 Classes amplitudes

preparing FORM code in /home/desy/FeynTools/feynhiggs1/gen/decays/fc-rc-1.frm
running FORM... 
ok

dZAA1heavy

Excluding 0 Generic, 4 Classes, and 12 Particles fields

inserting at level(s) {Generic, Classes}
> Top. 1: 2 Generic, 6 Classes insertions
> Top. 2: 5 Generic, 12 Classes insertions

Restoring 0 Generic, 4 Classes, and 12 Particles fields
in total: 7 Generic, 18 Classes insertions

creating amplitudes at level(s) {Generic, Classes}
> Top. 1: 2 Generic, 6 Classes amplitudes
> Top. 2: 5 Generic, 12 Classes amplitudes
in total: 7 Generic, 18 Classes amplitudes

preparing FORM code in /home/desy/FeynTools/feynhiggs1/gen/decays/fc-rc-1.frm
running FORM... 
ok

dZAA1light

Excluding 0 Generic, 0 Classes, and 2 Particles fields

inserting at level(s) {Particles}
> Top. 1: 0 Particles insertions
> Top. 2: 8 Particles insertions

Restoring 0 Generic, 0 Classes, and 2 Particles fields
in total: 8 Particles insertions

creating amplitudes at level(s) {Particles}
> Top. 1: 8 Particles amplitudes
in total: 8 Particles amplitudes

preparing FORM code in /home/desy/FeynTools/feynhiggs1/gen/decays/fc-rc-1.frm
running FORM... 
ok

dZZA1

Excluding 0 Generic, 3 Classes, and 3 Particles fields

inserting at level(s) {Generic, Classes}
> Top. 1: 2 Generic, 6 Classes insertions
> Top. 2: 5 Generic, 14 Classes insertions

Restoring 0 Generic, 3 Classes, and 3 Particles fields
in total: 7 Generic, 20 Classes insertions

creating amplitudes at level(s) {Generic, Classes}
> Top. 1: 2 Generic, 6 Classes amplitudes
> Top. 2: 5 Generic, 14 Classes amplitudes
in total: 7 Generic, 20 Classes amplitudes

preparing FORM code in /home/desy/FeynTools/feynhiggs1/gen/decays/fc-rc-1.frm
running FORM... 
ok

dMZsq1

Excluding 0 Generic, 3 Classes, and 3 Particles fields

inserting at level(s) {Generic, Classes}
> Top. 1: 2 Generic, 11 Classes insertions
> Top. 2: 5 Generic, 23 Classes insertions

Restoring 0 Generic, 3 Classes, and 3 Particles fields
in total: 7 Generic, 34 Classes insertions

creating amplitudes at level(s) {Generic, Classes}
> Top. 1: 2 Generic, 11 Classes amplitudes
> Top. 2: 5 Generic, 23 Classes amplitudes
in total: 7 Generic, 34 Classes amplitudes

preparing FORM code in /home/desy/FeynTools/feynhiggs1/gen/decays/fc-rc-1.frm
running FORM... 
ok

dSW1
dTB1
dZe1
dMHiggs1[1, 4]
dMHiggs1[2, 4]
dMHiggs1[3, 4]
dZHiggs1[1, 1]
dZHiggs1[1, 2]
dZHiggs1[2, 2]
dZHiggs1[3, 3]
dZHiggs1[3, 4]

In[110]:= In[110]:= 
