Mathematica 9.0 for Mac OS X x86 (64-bit)
Copyright 1988-2013 Wolfram Research, Inc.

In[1]:= 
FeynArts 3.9
by Hagen Eck, Sepp Kueblbeck, and Thomas Hahn
last revised 6 Sep 13

In[2]:= In[2]:= 
FormCalc 8.4
by Thomas Hahn
last revised 17 Feb 14

In[3]:= In[3]:= 
In[4]:= 
In[5]:= In[5]:= 
In[6]:= 
In[7]:= In[7]:= 
In[8]:= 
In[9]:= In[9]:= 
In[10]:= 
In[11]:= In[11]:= 
In[12]:= In[12]:= 
In[13]:= 
In[14]:= 
In[15]:= 
In[16]:= In[16]:= 
In[17]:= 
In[18]:= 
In[19]:= 
In[20]:= 
In[21]:= 
In[22]:= 
In[23]:= 
In[24]:= 
In[25]:= 
In[26]:= 
In[27]:= 
In[28]:= In[28]:= 
In[29]:= 
In[30]:= 
In[31]:= 
In[32]:= In[32]:= 
In[33]:= 
In[34]:= 
In[35]:= In[35]:= 
In[36]:= In[36]:= 
In[37]:= In[37]:= 
In[38]:= In[38]:= 
In[39]:= In[39]:= 
In[40]:= In[40]:= 
In[41]:= In[41]:= 
In[42]:= In[42]:= 
In[43]:= 
In[44]:= 
In[45]:= In[45]:= 
In[46]:= In[46]:= 
In[47]:= 
In[48]:= In[48]:= In[48]:= 
In[49]:= In[49]:= 
In[50]:= In[50]:= 
In[51]:= In[51]:= 
In[52]:= In[52]:= In[52]:= 
In[53]:= In[53]:= In[53]:= 
In[54]:= 
In[55]:= 
In[56]:= 
In[57]:= In[57]:= In[57]:= 
In[58]:= 
In[59]:= In[59]:=                                                                                  
In[60]:= In[60]:= In[60]:= 
In[61]:= In[61]:= In[61]:= 
In[62]:= In[62]:= 
In[63]:= 
In[64]:= 
In[65]:= In[65]:= 
In[66]:= In[66]:= 
In[67]:= 
In[68]:= 
In[69]:= In[69]:= 
In[70]:= 
In[71]:= In[71]:= 
In[72]:= In[72]:= 
In[73]:= In[73]:= In[73]:= 
In[74]:= In[74]:= In[74]:= 
In[75]:= In[75]:= 
In[76]:= In[76]:= 
In[77]:= In[77]:= In[77]:= 
In[78]:= In[78]:= 
In[79]:= In[79]:= 
In[80]:= In[80]:= 
In[81]:= In[81]:= 
In[82]:= In[82]:= In[82]:= 
In[83]:= In[83]:= 
In[84]:= In[84]:= In[84]:= 
In[85]:= In[85]:= 
In[86]:= In[86]:= 
In[87]:= In[87]:=                                              
In[88]:= In[88]:= 
In[89]:= In[89]:= In[89]:= 
In[90]:= 
In[91]:= 
In[92]:= 
In[93]:= 
In[94]:= In[94]:= 
Out[94]= Hel[2]

In[95]:= In[95]:= In[95]:= 
In[96]:= In[96]:= 
In[97]:= In[97]:= In[97]:= 
In[98]:= In[98]:= 
In[99]:= In[99]:= In[99]:= 
In[100]:= In[100]:= 
In[101]:= In[101]:= In[101]:= 
In[102]:= 
In[103]:= In[103]:= In[103]:= 
In[104]:= In[104]:= 
In[105]:= In[105]:= 
In[106]:= In[106]:= 
In[107]:= In[107]:= 
In[108]:= In[108]:= 
In[109]:= In[109]:= 
In[110]:= In[110]:= 
In[111]:= In[111]:= In[111]:=                                                   
In[112]:= In[112]:= In[112]:= 
In[113]:= In[113]:= In[113]:= 
loading generic model file /Users/hahn/FeynArts/Models/Lorentz.gen
> $GenericMixing is OFF
generic model {Lorentz} initialized

loading classes model file /Users/hahn/FeynArts/Models/SMQCD.mod
  loading classes model file /Users/hahn/FeynArts/Models/SM.mod
loading classes model file /Users/hahn/fh-2a/gen/decays/dAlfa.mod
loading classes model file /Users/hahn/fh-2a/gen/decays/dZH1.mod
> 49 particles (incl. antiparticles) in 18 classes
> $CounterTerms are ON
> 93 vertices
> 120 counter terms of order 1
> 6 counter terms of order 2
classes model {SMQCD, dAlfa, dZH1} initialized

Excluding 0 Generic, 2 Classes, and 2 Particles fields

inserting at level(s) {Generic, Classes}
> Top. 1: 1 Generic, 1 Classes insertions

Restoring 0 Generic, 2 Classes, and 2 Particles fields
in total: 1 Generic, 1 Classes insertions
V InsertFields done
CT top

Excluding 0 Generic, 2 Classes, and 2 Particles fields

Restoring 0 Generic, 2 Classes, and 2 Particles fields
in total: 0 Generic, 0 Classes insertions
CT ins
CT sel
CT InsertFields done

creating amplitudes at level(s) {Generic, Classes}
> Top. 1: 1 Generic, 1 Classes amplitudes
in total: 1 Generic, 1 Classes amplitudes
CreateFeynAmp done

preparing FORM code in /Users/hahn/fh-2a/gen/decays/fc-amp-2.frm
running FORM... ok
CalcFeynAmp done 0.599062
v0 done 0.600436

Excluding 0 Generic, 2 Classes, and 2 Particles fields

inserting at level(s) {Generic, Classes}
> Top. 1: 6 Generic, 14 Classes insertions
> Top. 2: 0 Generic, 0 Classes insertions
> Top. 3: 0 Generic, 0 Classes insertions
> Top. 4: 0 Generic, 0 Classes insertions

Restoring 0 Generic, 2 Classes, and 2 Particles fields
in total: 6 Generic, 14 Classes insertions
V InsertFields done
CT top

Excluding 0 Generic, 2 Classes, and 2 Particles fields

inserting at level(s) {Generic, Classes}
> Top. 1: 1 Generic, 1 Classes insertions

Restoring 0 Generic, 2 Classes, and 2 Particles fields
in total: 1 Generic, 1 Classes insertions
CT ins
CT sel
CT InsertFields done

creating amplitudes at level(s) {Generic, Classes}
> Top. 1: 6 Generic, 14 Classes amplitudes
> Top. 2: 1 Generic, 1 Classes amplitudes
in total: 7 Generic, 15 Classes amplitudes
CreateFeynAmp done

preparing FORM code in /Users/hahn/fh-2a/gen/decays/fc-amp-2.frm
running FORM... ok
CalcFeynAmp done 7.300916
v1 done 8.491955
FindRenConst done 9.151322
WriteSquaredME done 10.280308
dMWsq1

inserting at level(s) {Generic, Classes}
> Top. 1: 2 Generic, 6 Classes insertions
> Top. 2: 5 Generic, 13 Classes insertions
in total: 7 Generic, 19 Classes insertions

creating amplitudes at level(s) {Generic, Classes}
> Top. 1: 2 Generic, 6 Classes amplitudes
> Top. 2: 5 Generic, 13 Classes amplitudes
in total: 7 Generic, 19 Classes amplitudes

preparing FORM code in /Users/hahn/fh-2a/gen/decays/fc-rc-2.frm
running FORM... ok
dMZsq1

Excluding 0 Generic, 2 Classes, and 2 Particles fields

inserting at level(s) {Generic, Classes}
> Top. 1: 2 Generic, 4 Classes insertions
> Top. 2: 5 Generic, 12 Classes insertions

Restoring 0 Generic, 2 Classes, and 2 Particles fields
in total: 7 Generic, 16 Classes insertions

creating amplitudes at level(s) {Generic, Classes}
> Top. 1: 2 Generic, 4 Classes amplitudes
> Top. 2: 5 Generic, 12 Classes amplitudes
in total: 7 Generic, 16 Classes amplitudes

preparing FORM code in /Users/hahn/fh-2a/gen/decays/fc-rc-2.frm
running FORM... ok
dSW1
dZAA1heavy

Excluding 0 Generic, 4 Classes, and 12 Particles fields

inserting at level(s) {Generic, Classes}
> Top. 1: 2 Generic, 2 Classes insertions
> Top. 2: 5 Generic, 7 Classes insertions

Restoring 0 Generic, 4 Classes, and 12 Particles fields
in total: 7 Generic, 9 Classes insertions

creating amplitudes at level(s) {Generic, Classes}
> Top. 1: 2 Generic, 2 Classes amplitudes
> Top. 2: 5 Generic, 7 Classes amplitudes
in total: 7 Generic, 9 Classes amplitudes

preparing FORM code in /Users/hahn/fh-2a/gen/decays/fc-rc-2.frm
running FORM... ok
dZAA1light

Excluding 0 Generic, 0 Classes, and 2 Particles fields

inserting at level(s) {Particles}
> Top. 1: 0 Particles insertions
> Top. 2: 8 Particles insertions

Restoring 0 Generic, 0 Classes, and 2 Particles fields
in total: 8 Particles insertions

creating amplitudes at level(s) {Particles}
> Top. 1: 8 Particles amplitudes
in total: 8 Particles amplitudes

preparing FORM code in /Users/hahn/fh-2a/gen/decays/fc-rc-2.frm
running FORM... ok
dZe1
dZH1

Excluding 0 Generic, 2 Classes, and 2 Particles fields

inserting at level(s) {Generic, Classes}
> Top. 1: 2 Generic, 5 Classes insertions
> Top. 2: 5 Generic, 14 Classes insertions

Restoring 0 Generic, 2 Classes, and 2 Particles fields
in total: 7 Generic, 19 Classes insertions

creating amplitudes at level(s) {Generic, Classes}
> Top. 1: 2 Generic, 5 Classes amplitudes
> Top. 2: 5 Generic, 14 Classes amplitudes
in total: 7 Generic, 19 Classes amplitudes

preparing FORM code in /Users/hahn/fh-2a/gen/decays/fc-rc-2.frm
running FORM... ok
dZZA1

Excluding 0 Generic, 2 Classes, and 2 Particles fields

inserting at level(s) {Generic, Classes}
> Top. 1: 2 Generic, 2 Classes insertions
> Top. 2: 5 Generic, 9 Classes insertions

Restoring 0 Generic, 2 Classes, and 2 Particles fields
in total: 7 Generic, 11 Classes insertions

creating amplitudes at level(s) {Generic, Classes}
> Top. 1: 2 Generic, 2 Classes amplitudes
> Top. 2: 5 Generic, 9 Classes amplitudes
in total: 7 Generic, 11 Classes amplitudes

preparing FORM code in /Users/hahn/fh-2a/gen/decays/fc-rc-2.frm
running FORM... ok
dMf1[3, gno1]

Excluding 0 Generic, 2 Classes, and 2 Particles fields

inserting at level(s) {Generic, Classes}
> Top. 1: 0 Generic, 0 Classes insertions
> Top. 2: 2 Generic, 5 Classes insertions

Restoring 0 Generic, 2 Classes, and 2 Particles fields
in total: 2 Generic, 5 Classes insertions

creating amplitudes at level(s) {Generic, Classes}
> Top. 1: 2 Generic, 5 Classes amplitudes
in total: 2 Generic, 5 Classes amplitudes

preparing FORM code in /Users/hahn/fh-2a/gen/decays/fc-rc-2.frm
running FORM... ok
dZfL1[3, gno1, gno2]

Excluding 0 Generic, 2 Classes, and 2 Particles fields

inserting at level(s) {Generic, Classes}
> Top. 1: 0 Generic, 0 Classes insertions
> Top. 2: 2 Generic, 5 Classes insertions

Restoring 0 Generic, 2 Classes, and 2 Particles fields
in total: 2 Generic, 5 Classes insertions

creating amplitudes at level(s) {Generic, Classes}
> Top. 1: 2 Generic, 5 Classes amplitudes
in total: 2 Generic, 5 Classes amplitudes

preparing FORM code in /Users/hahn/fh-2a/gen/decays/fc-rc-2.frm
running FORM... ok
dZfR1[3, gno1, gno2]

Rule::argr: Rule called with 1 argument; 2 arguments are expected.

Block::lvlist: Local variable specification Rule[Sequence[]] is not a List.

OnePassOrder::recurs: 
   Recursive definition among {}
     (full list in $OnePassDebug).  Returning list unordered.

Transpose::nmtx: 
   The first two levels of the one-dimensional list 
    {{uzext == 2, 0}, Transpose[dZH1 -> {<<2>>}]} cannot be transposed.

Transpose::nmtx: 
   The first two levels of the one-dimensional list 
    {Transpose[dZH1 -> {<<2>>}]} cannot be transposed.

$RecursionLimit::reclim: Recursion depth of 1024 exceeded.

$RecursionLimit::reclim: Recursion depth of 1024 exceeded.

$RecursionLimit::reclim: Recursion depth of 1024 exceeded.

General::stop: Further output of $RecursionLimit::reclim
     will be suppressed during this calculation.
WriteRenConst done 23.544204

In[114]:= In[114]:= 
