Mathematica 9.0 for Linux x86 (64-bit)
Copyright 1988-2013 Wolfram Research, Inc.

In[1]:= In[1]:= 
In[2]:= In[2]:=                                                         
In[3]:= In[3]:= 
In[4]:= In[4]:= 
In[5]:= 
In[6]:= 
In[7]:= 
In[8]:= In[8]:= 
In[9]:= In[9]:= 
In[10]:= In[10]:= 
In[11]:=                            
In[12]:= In[12]:= 
In[13]:= In[13]:= 
In[14]:= 
In[15]:= In[15]:=                                     
In[16]:= In[16]:= 
In[17]:= 
In[18]:= 
In[19]:= In[19]:= 
In[20]:= In[20]:= 
In[21]:= In[21]:= 
In[22]:= In[22]:= In[22]:= In[22]:= 
In[23]:= In[23]:= In[23]:= In[23]:= In[23]:= In[23]:= 
In[24]:= In[24]:= 
In[25]:= 
In[26]:= 
In[27]:= In[27]:= 
In[28]:= In[28]:= In[28]:= In[28]:= In[28]:= In[28]:= 
In[29]:= In[29]:= In[29]:= In[29]:= 
Out[29]= /home/pcl335a/sborowka/Work/OasatPdep/SecDec3/loop/

In[30]:= In[30]:= In[30]:= 
In[31]:= In[31]:= In[31]:= In[31]:= 
Out[31]= /home/pcl335a/sborowka/Work/OasatPdep/SecDec3/loop/T1234m1110/

In[32]:= In[32]:= In[32]:= 
In[33]:= In[33]:= In[33]:= In[33]:= 
In[34]:= In[34]:= 
In[35]:= In[35]:= In[35]:= In[35]:= 
In[36]:= In[36]:= 
In[37]:= In[37]:= 
In[38]:= In[38]:= 
In[39]:= In[39]:= 
In[40]:= In[40]:= In[40]:= In[40]:= 
In[41]:= In[41]:= In[41]:= In[41]:= In[41]:= In[41]:= In[41]:= 
In[42]:= In[42]:= 
In[43]:= In[43]:= 

Time taken to do the decomposition: 0.149207 secs

In[44]:= 
