Mathematica 10.0 for Mac OS X x86 (64-bit)
Copyright 1988-2014 Wolfram Research, Inc.

In[1]:= 
In[2]:= In[2]:= << FeynArts`
FeynArts 3.9
by Hagen Eck, Sepp Kueblbeck, and Thomas Hahn
last revised 11 Jul 14

In[3]:= In[3]:= $ShapeDataDir = "./ShapeData";
In[4]:= In[4]:= << FormCalc`
FormCalc 8.4
by Thomas Hahn
last revised 14 Jul 14

In[5]:= In[5]:= MD = MD2 = Mdy[1] = 0;
In[6]:= MS = MS2 = Mdy[2] = 0;
In[7]:= MU = MU2 = 0;
In[8]:= MC = MC2 = 0;
In[9]:= MT = MTr;
In[10]:= MT2 = MTr2;
In[11]:= Sq[MTr] = MTr2;
In[12]:= In[12]:= Sq[Alfas] =.;
In[13]:= Alfas = asMW;
In[14]:= In[14]:= (*_USf = VCha = UCha = IndexDelta;*)
In[15]:= In[15]:= vec["bsgamma"] = V[1];
In[16]:= vec["bsglu"] = V[5];
In[17]:= In[17]:= opt["Hp"] = LastSelections -> S[5];
In[18]:= opt["Cha"] = LastSelections -> F[12];
In[19]:= opt["Neu"] = LastSelections -> F[11];
In[20]:= opt["Glu"] = LastSelections -> F[15];
In[21]:= opt["SM"] = ExcludeParticles -> {F[11|12|15],S[5]};
In[22]:= In[22]:= tops = CreateTopologies[1, 1 -> 2];
In[23]:= In[23]:= ins = InsertFields[tops,
  F[4,{3}] -> {F[4,{2}], vec[me]},
  InsertionLevel -> {Classes},
  opt[tag],
  Model -> myMSSMQCD];
loading generic model file /Users/hahn/FeynArts/Models/Lorentz.gen
> $GenericMixing is OFF
generic model {Lorentz} initialized

loading classes model file /Users/hahn/fh-2a/gen/bsg/myMSSMQCD.mod
  loading classes model file /Users/hahn/FeynArts/Models/FVMSSM.mod
    loading classes model file /Users/hahn/FeynArts/Models/MSSMQCD.mod
      loading classes model file /Users/hahn/FeynArts/Models/MSSM.mod
    loading classes model file /Users/hahn/FeynArts/Models/FV.mod

$FV = {13, 14}

> 67 particles (incl. antiparticles) in 26 classes
> $CounterTerms are ON
> 403 vertices
classes model {myMSSMQCD} initialized

Excluding 0 Generic, 6 Classes, and 6 Particles fields

inserting at level(s) {Classes}
> Top. 1: 6 Classes insertions
> Top. 2: 0 Classes insertions
> Top. 3: 0 Classes insertions
> Top. 4: 0 Classes insertions
> Top. 5: 0 Classes insertions
> Top. 6: 0 Classes insertions
> Top. 7: 0 Classes insertions
> Top. 8: 0 Classes insertions
> Top. 9: 0 Classes insertions
> Top. 10: 0 Classes insertions
> Top. 11: 0 Classes insertions
> Top. 12: 2 Classes insertions
> Top. 13: 0 Classes insertions
> Top. 14: 2 Classes insertions

Restoring 0 Generic, 6 Classes, and 6 Particles fields
in total: 10 Classes insertions

In[24]:= In[24]:= If[ debug === 1, Paint[ins,
  ColumnsXRows -> {3, 4},
  DisplayFunction -> (Export[name <> ".ps", #,
    ImageSize -> 72 2 {3, 4}]&)] ];> Top. 1: 6 diagrams
> Top. 2: 2 diagrams
> Top. 3: 2 diagrams

In[25]:= In[25]:= vert = CalcFeynAmp[CreateFeynAmp[ins],
  MomElim -> 2,
  FermionChains -> Chiral,
  FermionOrder -> None];
creating amplitudes at level(s) {Classes}
> Top. 1: 6 Classes amplitudes
> Top. 2: 2 Classes amplitudes
> Top. 3: 2 Classes amplitudes
in total: 10 Classes amplitudes

preparing FORM code in /Users/hahn/fh-2a/gen/bsg/fc-amp-1.frm
running FORM... ok

In[26]:= In[26]:= abbr = Join[ Abbr[] /.
    DiracChain[s2_Spinor, om_, mu_, s1:Spinor[p1_, m1_, _]] ->
      1/m1 (I/2 DiracChain[sigmunu[om]] +
            2 Pair[mu, p1] DiracChain[s2, om, s1]),
  Subexpr[] ];
In[27]:= In[27]:= mat[p_Plus] := mat/@ p;
In[28]:= In[28]:= mat[t_Times] := DeleteCases[t, _DiracChain | _SUNT] *
  mat@@ Cases[t, _DiracChain | _SUNT];
In[29]:= In[29]:= mat[DiracChain[sigmunu[om_]], SUNT[Col1, Col2]] :=
  Mat[O7[om]]/(EL MB/(16 Pi^2));
In[30]:= In[30]:= mat[DiracChain[sigmunu[om_]], SUNT[Glu3, Col2, Col1]] :=
  Mat[O8[om]]/(GS MB/(16 Pi^2));
In[31]:= In[31]:= coeff = Plus@@ (vert /. ToOldBRules) //. abbr /.
  Mat[p_] :> mat[Expand[p]] /.
  Den[p_, m_] -> 1/(p - m) /.
  SUNT -> sunt;
In[32]:= In[32]:= (*Put[coeff, name <> ".coeff"];*)
In[33]:= In[33]:= Lagpre = 4 GF/Sqrt[2] ckm[3][3,2];
In[34]:= In[34]:= CKM/: CKM[i_, j_] CKMC[i_, k_] := ckm[i][j,k];
In[35]:= In[35]:= ckm[1][i__] := -ckm[2][i] - ckm[3][i];
In[36]:= In[36]:= FeynCalcPut[
  Collect[coeff/Lagpre, _mat | _Mat, Simplify],
  name <> ".fc"]
In[37]:= 
Mathematica 10.0 for Mac OS X x86 (64-bit)
Copyright 1988-2014 Wolfram Research, Inc.

In[1]:= 
In[2]:= In[2]:= << FeynCalc` 
FeynCalc 2.2beta6 (October1994) |..#...|

In[3]:= In[3]:= test = Get[name <> ".fc"];
In[4]:= In[4]:= pave = Cases[test, _PaVe, Infinity] //Union;
In[5]:= In[5]:= pave = Thread[pave -> PaVeReduce[pave]];
In[6]:= In[6]:= test = test /. pave //PaVeOrder;
In[7]:= In[7]:= Put[test, name <> ".fc.red"]
In[8]:= 
Mathematica 10.0 for Mac OS X x86 (64-bit)
Copyright 1988-2014 Wolfram Research, Inc.

In[1]:= 
In[2]:= In[2]:= << FormCalc`
FormCalc 8.4
by Thomas Hahn
last revised 14 Jul 14

In[3]:= In[3]:= << FormCalc`tools`btensor`
In[4]:= In[4]:= NClear[];
In[5]:= N[sqrt2] = Sqrt[2.];
In[6]:= sqrt2/: sqrt2/2 = 1/sqrt2;
In[7]:= sqrt2/: sqrt2^2 = 2;
In[8]:= sqrt2/: sqrt2^-2 = 1/2;
In[9]:= In[9]:= Format[Mino3, FortranForm] := "M_3";
In[10]:= Format[Mino3C, FortranForm] := "M_3C";
In[11]:= In[11]:= Mdy[g_] := Mf[bTR, g];
In[12]:= MSf[s_,4,g_] := MSf[s,bTR,g];
In[13]:= MSf2[s_,4,g_] := MSf2[s,bTR,g];
In[14]:= USf[s__,4,g_] := USf[s,bTR,g];
In[15]:= USfC[s__,4,g_] := USfC[s,bTR,g];
In[16]:= MASf[as_,4] := MASf[as,bTR];
In[17]:= MASf2[as_,4] := MASf2[as,bTR];
In[18]:= UASf[as__,4] := UASf[as,bTR];
In[19]:= UASfC[as__,4] := UASfC[as,bTR];
In[20]:= Kf[g__,4] := Kf[g,bTR];
In[21]:= KfC[g__,4] := KfC[g,bTR];
In[22]:= In[22]:= Sq[MTr] = MTr2;
In[23]:= In[23]:= ckmtest[SumOver[g_, 3] ckm[g_][i_, j_] r_] := 0 /; FreeQ[r, g];
In[24]:= In[24]:= ckmtest[other_] = other;
In[25]:= In[25]:= In[25]:= test = Get[name <> ".fc.red"];
In[26]:= In[26]:= zero = ckmtest[Simplify[test /. _Mat -> 0]]
Out[26]= 0

In[27]:= In[27]:= If[ zero =!= 0,
  Print["WARNING: REMAINDER NOT ZERO"];
  Put[zero, name <> ".ZERO"] ];
In[28]:= In[28]:= In[28]:= Alfa = Sqrt[2]/Pi GF MW2 SW2;
In[29]:= ckm[i_][j_, k_] := CKM[i, j] CKMC[i, k];
In[30]:= In[30]:= test = Collect[test /. _mat -> 0, _SumOver, simp];
In[31]:= In[31]:= (*Put[test, name <> ".pre"];*)
In[32]:= In[32]:= test = test /. simp -> FullSimplify;
In[33]:= In[33]:= Put[test, name <> ".m"];
In[34]:= In[34]:= coeff = {
  ToSymbol[C7L, tag] -> SplitSums[Coefficient[test, Mat[O7[6]]]/I],
  ToSymbol[C8L, tag] -> SplitSums[Coefficient[test, Mat[O8[6]]]/I],
  ToSymbol[C7R, tag] -> SplitSums[Coefficient[test, Mat[O7[7]]]/I],
  ToSymbol[C8R, tag] -> SplitSums[Coefficient[test, Mat[O8[7]]]/I]
};
In[35]:= In[35]:= Put[coeff, name <> ".coeff"];
In[36]:= In[36]:= coeff = DeleteCases[coeff, _ -> {0}] /.
  {Sqrt[2] -> sqrt2, 1/Sqrt[2] -> 1/sqrt2};
In[37]:= In[37]:= hh = OpenFortran[name <> ".F"];
In[38]:= In[38]:= SetOptions[PrepareExpr,
  Expensive -> {_A0, _B0, _C0}];
In[39]:= In[39]:= SetOptions[WriteExpr,
  RealArgs -> {A0, B0, C0},
  HornerStyle -> False];
In[40]:= In[40]:= $DebugCmd = {"#ifdef DETAILED_DEBUG\n", "#endif\n", "DCONST ", " ENDL"};
In[41]:= In[41]:= WriteExpr[hh, coeff,
  TmpType -> False,
  Optimize -> True,
  DebugLines -> True,
  FinalCollect -> True];
In[42]:= In[42]:= Close[hh];
In[43]:= 
